RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_mxs40usbhsdev.h
/***************************************************************************//**
* \file cyip_mxs40usbhsdev.h
*
* \brief
* MXS40USBHSDEV IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_MXS40USBHSDEV_H_
#define _CYIP_MXS40USBHSDEV_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                MXS40USBHSDEV
*******************************************************************************/

#define USBHSDEV_SECTION_SIZE     0x00009400UL
#define USBHSPHY_SECTION_SIZE     0x00000100UL
#define MXS40USBHSDEV_SECTION_SIZE              0x0000A000UL

/**
  * \brief USB 2.0 Device Controller Registers (MXS40USBHSDEV_USBHSDEV)
  */
typedef struct {
  __IOM uint32_t MMIO_EPM_EGRS_SRAM[4096];      /*!< 0x00000000 EPM MMIO Egress SRAM */
  __IOM uint32_t MMIO_EPM_IGRS_SRAM[4096];      /*!< 0x00004000 EPM MMIO Ingress SRAM */
   __IM uint32_t RESERVED[1024];
  __IOM uint32_t DEV_CS;                        /*!< 0x00009000 Device controller Master Control and Status */
   __IM uint32_t DEV_FRAMECNT;                  /*!< 0x00009004 FRAMECNT register */
  __IOM uint32_t DEV_PWR_CS;                    /*!< 0x00009008 Power management control and status */
   __IM uint32_t DEV_SETUPDAT_0;                /*!< 0x0000900C SETUPDAT0 register */
   __IM uint32_t DEV_SETUPDAT_1;                /*!< 0x00009010 SETUPDAT1 register */
  __IOM uint32_t DEV_TOGGLE;                    /*!< 0x00009014 Data toggle for endpoints */
  __IOM uint32_t DEV_EPI_CS[16];                /*!< 0x00009018 IN Endpoint Control and Status register */
  __IOM uint32_t DEV_EPI_XFER_CNT[16];          /*!< 0x00009058 IN Endpoint remaining transfer length register */
  __IOM uint32_t DEV_EPO_CS[16];                /*!< 0x00009098 OUT Endpoint Control and Status */
  __IOM uint32_t DEV_EPO_XFER_CNT[16];          /*!< 0x000090D8 OUT Endpoint remaining transfer length register */
  __IOM uint32_t DEV_CTL_INTR_MASK;             /*!< 0x00009118 CONTROL interrupt mask register */
  __IOM uint32_t DEV_CTL_INTR;                  /*!< 0x0000911C CONTROL interrupt request register */
   __IM uint32_t DEV_CTL_INTR_MASKED;           /*!< 0x00009120 CONTROL interrupt masked register */
  __IOM uint32_t DEV_CTL_INTR_SET;              /*!< 0x00009124 CONTROL interrupt set register */
  __IOM uint32_t DEV_EP_INTR_MASK;              /*!< 0x00009128 USB EP interrupt mask register */
  __IOM uint32_t DEV_EP_INTR;                   /*!< 0x0000912C USB EP interrupt request register */
   __IM uint32_t DEV_EP_INTR_MASKED;            /*!< 0x00009130 USB EP interrupt masked register */
  __IOM uint32_t DEV_EP_INTR_SET;               /*!< 0x00009134 USB EP interrupt set register */
  __IOM uint32_t DEV_EP_INGRS_INTR_MASK;        /*!< 0x00009138 USB EP INGRS interrupt mask register */
  __IOM uint32_t DEV_EP_INGRS_INTR;             /*!< 0x0000913C USB EP INGRS interrupt request register */
   __IM uint32_t DEV_EP_INGRS_INTR_MASKED;      /*!< 0x00009140 USB EP INGRS interrupt masked register */
  __IOM uint32_t DEV_EP_INGRS_INTR_SET;         /*!< 0x00009144 USB EP INGRS interrupt set register */
  __IOM uint32_t DEV_EP_EGRS_REQ;               /*!< 0x00009148 USB EP Egress Request register */
  __IOM uint32_t DEV_EP_EGRS_INTR_MASK;         /*!< 0x0000914C USB EP EGRS interrupt mask register */
  __IOM uint32_t DEV_EP_EGRS_INTR;              /*!< 0x00009150 USB EP EGRS interrupt request register */
   __IM uint32_t DEV_EP_EGRS_INTR_MASKED;       /*!< 0x00009154 USB EP EGRS interrupt masked register */
  __IOM uint32_t DEV_EP_EGRS_INTR_SET;          /*!< 0x00009158 USB EP EGRS interrupt set register */
  __IOM uint32_t POWER;                         /*!< 0x0000915C USB 2.0 Device Power, Clock & Reset Control Register */
  __IOM uint32_t DEV_LPM_ATTR;                  /*!< 0x00009160 USB 2.0 Device LPM Register */
  __IOM uint32_t DEV_LPM_TIM_1;                 /*!< 0x00009164 USB 2.0 Device LPM Timer Parameter Register */
  __IOM uint32_t DEV_CHIRP_OVERRIDE;            /*!< 0x00009168 USB 2.0 Device Chirp Override Register */
  __IOM uint32_t DEV_TIM_T_DCHSE0;              /*!< 0x0000916C USB 2.0 Device Init Timing 0 Register */
  __IOM uint32_t DEV_TIM_T_DETRST_FILT;         /*!< 0x00009170 USB 2.0 Device Init Timing 1 Register */
  __IOM uint32_t DEV_TIM_T_WTFS;                /*!< 0x00009174 USB 2.0 Device Init Timing 2 Register */
  __IOM uint32_t DEV_TIM_T_SUSP;                /*!< 0x00009178 USB 2.0 Device Init Timing 3 Register */
  __IOM uint32_t DEV_TIM_T_WTRSTHS;             /*!< 0x0000917C USB 2.0 Device Init Timing 4 Register */
  __IOM uint32_t DEV_TIM_T_UCH;                 /*!< 0x00009180 USB 2.0 Device Init Timing 5 Register */
  __IOM uint32_t DEV_TIM_T_WTREV_WTRSTFS;       /*!< 0x00009184 USB 2.0 Device Init Timing 6 Register */
  __IOM uint32_t DDFT_CONFIG;                   /*!< 0x00009188 USB 2.0 DDFT Configuration Register */
   __IM uint32_t RESERVED1;
  __IOM uint32_t DEV_LOOPBACK_CTRL;             /*!< 0x00009190 USB 2.0 UTMI Loopback Control Register */
  __IOM uint32_t DEV_LOOPBACK_IN_REQ;           /*!< 0x00009194 USB 2.0 UTMI Loopback IN Token Request Register */
  __IOM uint32_t DEV_LOOPBACK_OUT_REQ;          /*!< 0x00009198 USB 2.0 UTMI Loopback OUT Token Request Register */
   __IM uint32_t RESERVED2[25];
  __IOM uint32_t EPM_CS;                        /*!< 0x00009200 EPM Control and Status Register */
   __IM uint32_t RESERVED3;
   __IM uint32_t EEPM_DEBUG;                    /*!< 0x00009208 Egress EPM Debug Register */
   __IM uint32_t IEPM_DEBUG;                    /*!< 0x0000920C Ingress EPM Debug Register */
   __IM uint32_t IEPM_DEBUG_1;                  /*!< 0x00009210 Ingress EPM Debug 1 Register */
   __IM uint32_t IEPM_DEBUG_2;                  /*!< 0x00009214 Ingress EPM Debug 2 Register */
   __IM uint32_t RESERVED4[2];
  __IOM uint32_t EEPM_ENDPOINT[16];             /*!< 0x00009220 Egress EPM per Endpoint Control and Status */
  __IOM uint32_t IEPM_ENDPOINT[16];             /*!< 0x00009260 Ingress EPM Per Endpoint Control and Status */
   __IM uint32_t EEPM_DEBUG_ENDPOINT[16];       /*!< 0x000092A0 Egress EPM Per Endpoint Debug */
   __IM uint32_t IEPM_DEBUG_ENDPOINT[16];       /*!< 0x000092E0 Ingress EPM Per Endpoint Debug */
  __IOM uint32_t MMIO_EEPM_ENDPOINT[16];        /*!< 0x00009320 MMIO Egress EPM per Endpoint Control and Status */
  __IOM uint32_t MMIO_IEPM_ENDPOINT[16];        /*!< 0x00009360 MMIO Ingress EPM Per Endpoint Control and Status */
  __IOM uint32_t DEV_SPARE_1;                   /*!< 0x000093A0 DEV SPARE 1 Register */
  __IOM uint32_t DEV_SPARE_2;                   /*!< 0x000093A4 DEV SPARE 2 Register */
  __IOM uint32_t LEGACY_FEATURE_ENABLE;         /*!< 0x000093A8 Legacy Feature Enable Register */
   __IM uint32_t DFT_OBSERVE;                   /*!< 0x000093AC DFT Observable Register */
   __IM uint32_t RESERVED5[20];
} USBHSDEV_V1_Type;               /*!< Size = 37888 (0x9400) */

/**
  * \brief USB 2.0 PHY Registers (MXS40USBHSDEV_USBHSPHY)
  */
typedef struct {
  __IOM uint32_t AFE_CONTROL_1;                 /*!< 0x00000000 AFE Control register #1 */
  __IOM uint32_t AFE_CONTROL_2;                 /*!< 0x00000004 AFE Control register #2 */
  __IOM uint32_t UTMI_CONTROL;                  /*!< 0x00000008 UTMI Control register */
  __IOM uint32_t CDR_CONTROL;                   /*!< 0x0000000C CDR registers */
  __IOM uint32_t BC_CONTROL;                    /*!< 0x00000010 UHC Battery Charging CSR Bank */
  __IOM uint32_t PLL_CONTROL_1;                 /*!< 0x00000014 Primary PLL control register#1 */
  __IOM uint32_t PLL_CONTROL_2;                 /*!< 0x00000018 Primary PLL control register#2 */
  __IOM uint32_t TEST_PLL_CONTROL;              /*!< 0x0000001C Test PLL control register */
  __IOM uint32_t TEST_CONTROL;                  /*!< 0x00000020 Test control register */
  __IOM uint32_t DDFT_CFG;                      /*!< 0x00000024 DDFT configuration */
  __IOM uint32_t DIGITAL_CONTROL;               /*!< 0x00000028 Provides control and configuration to digital blocks */
  __IOM uint32_t VREFGEN_CONTROL;               /*!< 0x0000002C VREFGEN control */
  __IOM uint32_t REG_SW_1P2_CONTROL;            /*!< 0x00000030 REG_SW_1P2 control */
  __IOM uint32_t REG_1P1_CONTROL;               /*!< 0x00000034 REG_1P1 control */
  __IOM uint32_t REG_2P5_CONTROL;               /*!< 0x00000038 REG_2P5_ control */
  __IOM uint32_t IREFGEN_CONTROL;               /*!< 0x0000003C IREFGEN_ control */
   __IM uint32_t STATUS;                        /*!< 0x00000040 Status */
  __IOM uint32_t INTR0;                         /*!< 0x00000044 INTR0 Cause. These are the wakeup interrupts get reflected on
                                                                interrupt_wakeup pin. */
  __IOM uint32_t INTR0_SET;                     /*!< 0x00000048 INTR0 Set */
  __IOM uint32_t INTR0_MASK;                    /*!< 0x0000004C INTR0 Mask */
   __IM uint32_t INTR0_MASKED;                  /*!< 0x00000050 INTR0 Masked */
  __IOM uint32_t SPARE;                         /*!< 0x00000054 Spare */
  __IOM uint32_t AFE_CONTROL_3;                 /*!< 0x00000058 AFE Control register #3 */
  __IOM uint32_t AFE_CONTROL_4;                 /*!< 0x0000005C AFE Control register #4 */
  __IOM uint32_t UTMI_CONTROL_2;                /*!< 0x00000060 UTMI Configurtation Registers */
   __IM uint32_t RESERVED[35];
  __IOM uint32_t PLL_TRIMS;                     /*!< 0x000000F0 Trim register for the PLL */
  __IOM uint32_t AFE_TRIMS;                     /*!< 0x000000F4 Trim register for the AFE */
   __IM uint32_t RESERVED1[2];
} USBHSPHY_V1_Type;               /*!< Size = 256 (0x100) */

/**
  * \brief USB 2 Device Controller Memory Register Map (MXS40USBHSDEV)
  */
typedef struct {
        USBHSDEV_V1_Type USBHSDEV; /*!< 0x00000000 USB 2.0 Device Controller Registers */
   __IM uint32_t RESERVED[256];
        USBHSPHY_V1_Type USBHSPHY; /*!< 0x00009800 USB 2.0 PHY Registers */
} MXS40USBHSDEV_V1_Type;                        /*!< Size = 39168 (0x9900) */


