RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_mxs40usbhsdev.h
/* MXS40USBHSDEV_USBHSDEV.MMIO_EPM_EGRS_SRAM */
#define USBHSDEV_MMIO_EPM_EGRS_SRAM_DATA_Pos 0UL
#define USBHSDEV_MMIO_EPM_EGRS_SRAM_DATA_Msk 0xFFFFFFFFUL
/* MXS40USBHSDEV_USBHSDEV.MMIO_EPM_IGRS_SRAM */
#define USBHSDEV_MMIO_EPM_IGRS_SRAM_DATA_Pos 0UL
#define USBHSDEV_MMIO_EPM_IGRS_SRAM_DATA_Msk 0xFFFFFFFFUL
/* MXS40USBHSDEV_USBHSDEV.DEV_CS */
#define USBHSDEV_DEV_CS_ERR_LIMIT_Pos 0UL
#define USBHSDEV_DEV_CS_ERR_LIMIT_Msk 0xFFUL
#define USBHSDEV_DEV_CS_COUNT_Pos 8UL
#define USBHSDEV_DEV_CS_COUNT_Msk 0xFF00UL
#define USBHSDEV_DEV_CS_DEVICEADDR_Pos 16UL
#define USBHSDEV_DEV_CS_DEVICEADDR_Msk 0x7F0000UL
#define USBHSDEV_DEV_CS_TEST_MODE_Pos 23UL
#define USBHSDEV_DEV_CS_TEST_MODE_Msk 0x3800000UL
#define USBHSDEV_DEV_CS_SETUP_CLR_BUSY_Pos 26UL
#define USBHSDEV_DEV_CS_SETUP_CLR_BUSY_Msk 0x4000000UL
#define USBHSDEV_DEV_CS_CONT_TO_DATA_Pos 27UL
#define USBHSDEV_DEV_CS_CONT_TO_DATA_Msk 0x8000000UL
#define USBHSDEV_DEV_CS_NAKALL_Pos 31UL
#define USBHSDEV_DEV_CS_NAKALL_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_FRAMECNT */
#define USBHSDEV_DEV_FRAMECNT_MICROFRAME_Pos 0UL
#define USBHSDEV_DEV_FRAMECNT_MICROFRAME_Msk 0x7UL
#define USBHSDEV_DEV_FRAMECNT_FRAMECNT_Pos 3UL
#define USBHSDEV_DEV_FRAMECNT_FRAMECNT_Msk 0x3FF8UL
/* MXS40USBHSDEV_USBHSDEV.DEV_PWR_CS */
#define USBHSDEV_DEV_PWR_CS_SIGRSUME_Pos 0UL
#define USBHSDEV_DEV_PWR_CS_SIGRSUME_Msk 0x1UL
#define USBHSDEV_DEV_PWR_CS_NOSYNSOF_Pos 2UL
#define USBHSDEV_DEV_PWR_CS_NOSYNSOF_Msk 0x4UL
#define USBHSDEV_DEV_PWR_CS_DISCON_Pos 3UL
#define USBHSDEV_DEV_PWR_CS_DISCON_Msk 0x8UL
#define USBHSDEV_DEV_PWR_CS_DEV_SUSPEND_Pos 4UL
#define USBHSDEV_DEV_PWR_CS_DEV_SUSPEND_Msk 0x10UL
#define USBHSDEV_DEV_PWR_CS_FORCE_FS_Pos 6UL
#define USBHSDEV_DEV_PWR_CS_FORCE_FS_Msk 0x40UL
#define USBHSDEV_DEV_PWR_CS_HSM_Pos 7UL
#define USBHSDEV_DEV_PWR_CS_HSM_Msk 0x80UL
#define USBHSDEV_DEV_PWR_CS_L0_ACTIVE_Pos 8UL
#define USBHSDEV_DEV_PWR_CS_L0_ACTIVE_Msk 0x100UL
#define USBHSDEV_DEV_PWR_CS_L2_SUSPEND_Pos 9UL
#define USBHSDEV_DEV_PWR_CS_L2_SUSPEND_Msk 0x200UL
#define USBHSDEV_DEV_PWR_CS_L1_SLEEP_Pos 10UL
#define USBHSDEV_DEV_PWR_CS_L1_SLEEP_Msk 0x400UL
/* MXS40USBHSDEV_USBHSDEV.DEV_SETUPDAT_0 */
#define USBHSDEV_DEV_SETUPDAT_0_SETUP_REQUEST_TYPE_Pos 0UL
#define USBHSDEV_DEV_SETUPDAT_0_SETUP_REQUEST_TYPE_Msk 0xFFUL
#define USBHSDEV_DEV_SETUPDAT_0_SETUP_REQUEST_Pos 8UL
#define USBHSDEV_DEV_SETUPDAT_0_SETUP_REQUEST_Msk 0xFF00UL
#define USBHSDEV_DEV_SETUPDAT_0_SETUP_VALUE_Pos 16UL
#define USBHSDEV_DEV_SETUPDAT_0_SETUP_VALUE_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_SETUPDAT_1 */
#define USBHSDEV_DEV_SETUPDAT_1_SETUP_INDEX_Pos 0UL
#define USBHSDEV_DEV_SETUPDAT_1_SETUP_INDEX_Msk 0xFFFFUL
#define USBHSDEV_DEV_SETUPDAT_1_SETUP_LENGTH_Pos 16UL
#define USBHSDEV_DEV_SETUPDAT_1_SETUP_LENGTH_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_TOGGLE */
#define USBHSDEV_DEV_TOGGLE_ENDPOINT_Pos 0UL
#define USBHSDEV_DEV_TOGGLE_ENDPOINT_Msk 0xFUL
#define USBHSDEV_DEV_TOGGLE_IO_Pos 4UL
#define USBHSDEV_DEV_TOGGLE_IO_Msk 0x10UL
#define USBHSDEV_DEV_TOGGLE_R_Pos 5UL
#define USBHSDEV_DEV_TOGGLE_R_Msk 0x20UL
#define USBHSDEV_DEV_TOGGLE_S_Pos 6UL
#define USBHSDEV_DEV_TOGGLE_S_Msk 0x40UL
#define USBHSDEV_DEV_TOGGLE_Q_Pos 7UL
#define USBHSDEV_DEV_TOGGLE_Q_Msk 0x80UL
#define USBHSDEV_DEV_TOGGLE_TOGGLE_VALID_Pos 8UL
#define USBHSDEV_DEV_TOGGLE_TOGGLE_VALID_Msk 0x100UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EPI_CS */
#define USBHSDEV_DEV_EPI_CS_PAYLOAD_Pos 0UL
#define USBHSDEV_DEV_EPI_CS_PAYLOAD_Msk 0x3FFUL
#define USBHSDEV_DEV_EPI_CS_TYPE_Pos 10UL
#define USBHSDEV_DEV_EPI_CS_TYPE_Msk 0xC00UL
#define USBHSDEV_DEV_EPI_CS_ISOINPKS_Pos 12UL
#define USBHSDEV_DEV_EPI_CS_ISOINPKS_Msk 0x3000UL
#define USBHSDEV_DEV_EPI_CS_VALID_Pos 14UL
#define USBHSDEV_DEV_EPI_CS_VALID_Msk 0x4000UL
#define USBHSDEV_DEV_EPI_CS_NAK_Pos 15UL
#define USBHSDEV_DEV_EPI_CS_NAK_Msk 0x8000UL
#define USBHSDEV_DEV_EPI_CS_STALL_Pos 16UL
#define USBHSDEV_DEV_EPI_CS_STALL_Msk 0x10000UL
#define USBHSDEV_DEV_EPI_CS_COMMIT_Pos 18UL
#define USBHSDEV_DEV_EPI_CS_COMMIT_Msk 0x40000UL
#define USBHSDEV_DEV_EPI_CS_BNAK_Pos 19UL
#define USBHSDEV_DEV_EPI_CS_BNAK_Msk 0x80000UL
#define USBHSDEV_DEV_EPI_CS_DONE_Pos 20UL
#define USBHSDEV_DEV_EPI_CS_DONE_Msk 0x100000UL
#define USBHSDEV_DEV_EPI_CS_ZERO_Pos 21UL
#define USBHSDEV_DEV_EPI_CS_ZERO_Msk 0x200000UL
#define USBHSDEV_DEV_EPI_CS_SHORT_Pos 22UL
#define USBHSDEV_DEV_EPI_CS_SHORT_Msk 0x400000UL
#define USBHSDEV_DEV_EPI_CS_ISOERR_Pos 23UL
#define USBHSDEV_DEV_EPI_CS_ISOERR_Msk 0x800000UL
#define USBHSDEV_DEV_EPI_CS_COMMIT_MASK_Pos 26UL
#define USBHSDEV_DEV_EPI_CS_COMMIT_MASK_Msk 0x4000000UL
#define USBHSDEV_DEV_EPI_CS_BNAK_MASK_Pos 27UL
#define USBHSDEV_DEV_EPI_CS_BNAK_MASK_Msk 0x8000000UL
#define USBHSDEV_DEV_EPI_CS_DONE_MASK_Pos 28UL
#define USBHSDEV_DEV_EPI_CS_DONE_MASK_Msk 0x10000000UL
#define USBHSDEV_DEV_EPI_CS_ZERO_MASK_Pos 29UL
#define USBHSDEV_DEV_EPI_CS_ZERO_MASK_Msk 0x20000000UL
#define USBHSDEV_DEV_EPI_CS_SHORT_MASK_Pos 30UL
#define USBHSDEV_DEV_EPI_CS_SHORT_MASK_Msk 0x40000000UL
#define USBHSDEV_DEV_EPI_CS_ISOERR_MASK_Pos 31UL
#define USBHSDEV_DEV_EPI_CS_ISOERR_MASK_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EPI_XFER_CNT */
#define USBHSDEV_DEV_EPI_XFER_CNT_BYTES_REMAINING_Pos 0UL
#define USBHSDEV_DEV_EPI_XFER_CNT_BYTES_REMAINING_Msk 0xFFFFFFFFUL
/* MXS40USBHSDEV_USBHSDEV.DEV_EPO_CS */
#define USBHSDEV_DEV_EPO_CS_PAYLOAD_Pos 0UL
#define USBHSDEV_DEV_EPO_CS_PAYLOAD_Msk 0x3FFUL
#define USBHSDEV_DEV_EPO_CS_TYPE_Pos 10UL
#define USBHSDEV_DEV_EPO_CS_TYPE_Msk 0xC00UL
#define USBHSDEV_DEV_EPO_CS_ISOINPKS_Pos 12UL
#define USBHSDEV_DEV_EPO_CS_ISOINPKS_Msk 0x3000UL
#define USBHSDEV_DEV_EPO_CS_VALID_Pos 14UL
#define USBHSDEV_DEV_EPO_CS_VALID_Msk 0x4000UL
#define USBHSDEV_DEV_EPO_CS_NAK_Pos 15UL
#define USBHSDEV_DEV_EPO_CS_NAK_Msk 0x8000UL
#define USBHSDEV_DEV_EPO_CS_STALL_Pos 16UL
#define USBHSDEV_DEV_EPO_CS_STALL_Msk 0x10000UL
#define USBHSDEV_DEV_EPO_CS_OVF_Pos 17UL
#define USBHSDEV_DEV_EPO_CS_OVF_Msk 0x20000UL
#define USBHSDEV_DEV_EPO_CS_COMMIT_Pos 18UL
#define USBHSDEV_DEV_EPO_CS_COMMIT_Msk 0x40000UL
#define USBHSDEV_DEV_EPO_CS_BNAK_Pos 19UL
#define USBHSDEV_DEV_EPO_CS_BNAK_Msk 0x80000UL
#define USBHSDEV_DEV_EPO_CS_DONE_Pos 20UL
#define USBHSDEV_DEV_EPO_CS_DONE_Msk 0x100000UL
#define USBHSDEV_DEV_EPO_CS_ZERO_Pos 21UL
#define USBHSDEV_DEV_EPO_CS_ZERO_Msk 0x200000UL
#define USBHSDEV_DEV_EPO_CS_SHORT_Pos 22UL
#define USBHSDEV_DEV_EPO_CS_SHORT_Msk 0x400000UL
#define USBHSDEV_DEV_EPO_CS_ISOERR_Pos 23UL
#define USBHSDEV_DEV_EPO_CS_ISOERR_Msk 0x800000UL
#define USBHSDEV_DEV_EPO_CS_OVF_MASK_Pos 25UL
#define USBHSDEV_DEV_EPO_CS_OVF_MASK_Msk 0x2000000UL
#define USBHSDEV_DEV_EPO_CS_COMMIT_MASK_Pos 26UL
#define USBHSDEV_DEV_EPO_CS_COMMIT_MASK_Msk 0x4000000UL
#define USBHSDEV_DEV_EPO_CS_BNAK_MASK_Pos 27UL
#define USBHSDEV_DEV_EPO_CS_BNAK_MASK_Msk 0x8000000UL
#define USBHSDEV_DEV_EPO_CS_DONE_MASK_Pos 28UL
#define USBHSDEV_DEV_EPO_CS_DONE_MASK_Msk 0x10000000UL
#define USBHSDEV_DEV_EPO_CS_ZERO_MASK_Pos 29UL
#define USBHSDEV_DEV_EPO_CS_ZERO_MASK_Msk 0x20000000UL
#define USBHSDEV_DEV_EPO_CS_SHORT_MASK_Pos 30UL
#define USBHSDEV_DEV_EPO_CS_SHORT_MASK_Msk 0x40000000UL
#define USBHSDEV_DEV_EPO_CS_ISOERR_MASK_Pos 31UL
#define USBHSDEV_DEV_EPO_CS_ISOERR_MASK_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EPO_XFER_CNT */
#define USBHSDEV_DEV_EPO_XFER_CNT_BYTES_REMAINING_Pos 0UL
#define USBHSDEV_DEV_EPO_XFER_CNT_BYTES_REMAINING_Msk 0xFFFFFFFFUL
/* MXS40USBHSDEV_USBHSDEV.DEV_CTL_INTR_MASK */
#define USBHSDEV_DEV_CTL_INTR_MASK_SETADDR_Pos 0UL
#define USBHSDEV_DEV_CTL_INTR_MASK_SETADDR_Msk 0x1UL
#define USBHSDEV_DEV_CTL_INTR_MASK_SOF_Pos 1UL
#define USBHSDEV_DEV_CTL_INTR_MASK_SOF_Msk 0x2UL
#define USBHSDEV_DEV_CTL_INTR_MASK_SUSP_Pos 2UL
#define USBHSDEV_DEV_CTL_INTR_MASK_SUSP_Msk 0x4UL
#define USBHSDEV_DEV_CTL_INTR_MASK_URESET_Pos 3UL
#define USBHSDEV_DEV_CTL_INTR_MASK_URESET_Msk 0x8UL
#define USBHSDEV_DEV_CTL_INTR_MASK_HSGRANT_Pos 4UL
#define USBHSDEV_DEV_CTL_INTR_MASK_HSGRANT_Msk 0x10UL
#define USBHSDEV_DEV_CTL_INTR_MASK_SUTOK_Pos 5UL
#define USBHSDEV_DEV_CTL_INTR_MASK_SUTOK_Msk 0x20UL
#define USBHSDEV_DEV_CTL_INTR_MASK_SUDAV_Pos 6UL
#define USBHSDEV_DEV_CTL_INTR_MASK_SUDAV_Msk 0x40UL
#define USBHSDEV_DEV_CTL_INTR_MASK_ERRLIMIT_Pos 7UL
#define USBHSDEV_DEV_CTL_INTR_MASK_ERRLIMIT_Msk 0x80UL
#define USBHSDEV_DEV_CTL_INTR_MASK_URESUME_Pos 8UL
#define USBHSDEV_DEV_CTL_INTR_MASK_URESUME_Msk 0x100UL
#define USBHSDEV_DEV_CTL_INTR_MASK_STATUS_STAGE_Pos 9UL
#define USBHSDEV_DEV_CTL_INTR_MASK_STATUS_STAGE_Msk 0x200UL
#define USBHSDEV_DEV_CTL_INTR_MASK_L1_SLEEP_REQ_Pos 10UL
#define USBHSDEV_DEV_CTL_INTR_MASK_L1_SLEEP_REQ_Msk 0x400UL
#define USBHSDEV_DEV_CTL_INTR_MASK_L1_URESUME_Pos 11UL
#define USBHSDEV_DEV_CTL_INTR_MASK_L1_URESUME_Msk 0x800UL
#define USBHSDEV_DEV_CTL_INTR_MASK_RESETDONE_Pos 12UL
#define USBHSDEV_DEV_CTL_INTR_MASK_RESETDONE_Msk 0x1000UL
#define USBHSDEV_DEV_CTL_INTR_MASK_HOST_URSUME_ARRIVED_Pos 13UL
#define USBHSDEV_DEV_CTL_INTR_MASK_HOST_URSUME_ARRIVED_Msk 0x2000UL
#define USBHSDEV_DEV_CTL_INTR_MASK_DPSLP_Pos 14UL
#define USBHSDEV_DEV_CTL_INTR_MASK_DPSLP_Msk 0x4000UL
#define USBHSDEV_DEV_CTL_INTR_MASK_PID_MISMATCH_ON_NAK_Pos 15UL
#define USBHSDEV_DEV_CTL_INTR_MASK_PID_MISMATCH_ON_NAK_Msk 0x8000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_CTL_INTR */
#define USBHSDEV_DEV_CTL_INTR_SETADDR_Pos 0UL
#define USBHSDEV_DEV_CTL_INTR_SETADDR_Msk 0x1UL
#define USBHSDEV_DEV_CTL_INTR_SOF_Pos 1UL
#define USBHSDEV_DEV_CTL_INTR_SOF_Msk 0x2UL
#define USBHSDEV_DEV_CTL_INTR_SUSP_Pos 2UL
#define USBHSDEV_DEV_CTL_INTR_SUSP_Msk 0x4UL
#define USBHSDEV_DEV_CTL_INTR_URESET_Pos 3UL
#define USBHSDEV_DEV_CTL_INTR_URESET_Msk 0x8UL
#define USBHSDEV_DEV_CTL_INTR_HSGRANT_Pos 4UL
#define USBHSDEV_DEV_CTL_INTR_HSGRANT_Msk 0x10UL
#define USBHSDEV_DEV_CTL_INTR_SUTOK_Pos 5UL
#define USBHSDEV_DEV_CTL_INTR_SUTOK_Msk 0x20UL
#define USBHSDEV_DEV_CTL_INTR_SUDAV_Pos 6UL
#define USBHSDEV_DEV_CTL_INTR_SUDAV_Msk 0x40UL
#define USBHSDEV_DEV_CTL_INTR_ERRLIMIT_Pos 7UL
#define USBHSDEV_DEV_CTL_INTR_ERRLIMIT_Msk 0x80UL
#define USBHSDEV_DEV_CTL_INTR_URESUME_Pos 8UL
#define USBHSDEV_DEV_CTL_INTR_URESUME_Msk 0x100UL
#define USBHSDEV_DEV_CTL_INTR_STATUS_STAGE_Pos 9UL
#define USBHSDEV_DEV_CTL_INTR_STATUS_STAGE_Msk 0x200UL
#define USBHSDEV_DEV_CTL_INTR_L1_SLEEP_REQ_Pos 10UL
#define USBHSDEV_DEV_CTL_INTR_L1_SLEEP_REQ_Msk 0x400UL
#define USBHSDEV_DEV_CTL_INTR_L1_URESUME_Pos 11UL
#define USBHSDEV_DEV_CTL_INTR_L1_URESUME_Msk 0x800UL
#define USBHSDEV_DEV_CTL_INTR_RESETDONE_Pos 12UL
#define USBHSDEV_DEV_CTL_INTR_RESETDONE_Msk 0x1000UL
#define USBHSDEV_DEV_CTL_INTR_HOST_URSUME_ARRIVED_Pos 13UL
#define USBHSDEV_DEV_CTL_INTR_HOST_URSUME_ARRIVED_Msk 0x2000UL
#define USBHSDEV_DEV_CTL_INTR_DPSLP_Pos 14UL
#define USBHSDEV_DEV_CTL_INTR_DPSLP_Msk 0x4000UL
#define USBHSDEV_DEV_CTL_INTR_PID_MISMATCH_ON_NAK_Pos 15UL
#define USBHSDEV_DEV_CTL_INTR_PID_MISMATCH_ON_NAK_Msk 0x8000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_CTL_INTR_MASKED */
#define USBHSDEV_DEV_CTL_INTR_MASKED_SETADDR_MASKED_Pos 0UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_SETADDR_MASKED_Msk 0x1UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_SOF_MASKED_Pos 1UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_SOF_MASKED_Msk 0x2UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_SUSP_MASKED_Pos 2UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_SUSP_MASKED_Msk 0x4UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_URESET_MASKED_Pos 3UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_URESET_MASKED_Msk 0x8UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_HSGRANT_MASKED_Pos 4UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_HSGRANT_MASKED_Msk 0x10UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_SUTOK_MASKED_Pos 5UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_SUTOK_MASKED_Msk 0x20UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_SUDAV_MASKED_Pos 6UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_SUDAV_MASKED_Msk 0x40UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_ERRLIMIT_MASKED_Pos 7UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_ERRLIMIT_MASKED_Msk 0x80UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_URESUME_MASKED_Pos 8UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_URESUME_MASKED_Msk 0x100UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_STATUS_STAGE_MASKED_Pos 9UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_STATUS_STAGE_MASKED_Msk 0x200UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_L1_SLEEP_REQ_MASKED_Pos 10UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_L1_SLEEP_REQ_MASKED_Msk 0x400UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_L1_URESUME_MASKED_Pos 11UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_L1_URESUME_MASKED_Msk 0x800UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_RESETDONE_MASKED_Pos 12UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_RESETDONE_MASKED_Msk 0x1000UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_HOST_URSUME_ARRIVED_MASKED_Pos 13UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_HOST_URSUME_ARRIVED_MASKED_Msk 0x2000UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_DPSLP_MASKED_Pos 14UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_DPSLP_MASKED_Msk 0x4000UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_PID_MISMATCH_ON_NAK_MASKED_Pos 15UL
#define USBHSDEV_DEV_CTL_INTR_MASKED_PID_MISMATCH_ON_NAK_MASKED_Msk 0x8000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_CTL_INTR_SET */
#define USBHSDEV_DEV_CTL_INTR_SET_SETADDR_MASKED_Pos 0UL
#define USBHSDEV_DEV_CTL_INTR_SET_SETADDR_MASKED_Msk 0x1UL
#define USBHSDEV_DEV_CTL_INTR_SET_SOF_MASKED_Pos 1UL
#define USBHSDEV_DEV_CTL_INTR_SET_SOF_MASKED_Msk 0x2UL
#define USBHSDEV_DEV_CTL_INTR_SET_SUSP_MASKED_Pos 2UL
#define USBHSDEV_DEV_CTL_INTR_SET_SUSP_MASKED_Msk 0x4UL
#define USBHSDEV_DEV_CTL_INTR_SET_URESET_MASKED_Pos 3UL
#define USBHSDEV_DEV_CTL_INTR_SET_URESET_MASKED_Msk 0x8UL
#define USBHSDEV_DEV_CTL_INTR_SET_HSGRANT_MASKED_Pos 4UL
#define USBHSDEV_DEV_CTL_INTR_SET_HSGRANT_MASKED_Msk 0x10UL
#define USBHSDEV_DEV_CTL_INTR_SET_SUTOK_MASKED_Pos 5UL
#define USBHSDEV_DEV_CTL_INTR_SET_SUTOK_MASKED_Msk 0x20UL
#define USBHSDEV_DEV_CTL_INTR_SET_SUDAV_MASKED_Pos 6UL
#define USBHSDEV_DEV_CTL_INTR_SET_SUDAV_MASKED_Msk 0x40UL
#define USBHSDEV_DEV_CTL_INTR_SET_ERRLIMIT_MASKED_Pos 7UL
#define USBHSDEV_DEV_CTL_INTR_SET_ERRLIMIT_MASKED_Msk 0x80UL
#define USBHSDEV_DEV_CTL_INTR_SET_URESUME_MASKED_Pos 8UL
#define USBHSDEV_DEV_CTL_INTR_SET_URESUME_MASKED_Msk 0x100UL
#define USBHSDEV_DEV_CTL_INTR_SET_STATUS_STAGE_MASKED_Pos 9UL
#define USBHSDEV_DEV_CTL_INTR_SET_STATUS_STAGE_MASKED_Msk 0x200UL
#define USBHSDEV_DEV_CTL_INTR_SET_L1_SLEEP_REQ_MASKED_Pos 10UL
#define USBHSDEV_DEV_CTL_INTR_SET_L1_SLEEP_REQ_MASKED_Msk 0x400UL
#define USBHSDEV_DEV_CTL_INTR_SET_L1_URESUME_MASKED_Pos 11UL
#define USBHSDEV_DEV_CTL_INTR_SET_L1_URESUME_MASKED_Msk 0x800UL
#define USBHSDEV_DEV_CTL_INTR_SET_RESETDONE_MASKED_Pos 12UL
#define USBHSDEV_DEV_CTL_INTR_SET_RESETDONE_MASKED_Msk 0x1000UL
#define USBHSDEV_DEV_CTL_INTR_SET_HOST_URSUME_ARRIVED_MASKED_Pos 13UL
#define USBHSDEV_DEV_CTL_INTR_SET_HOST_URSUME_ARRIVED_MASKED_Msk 0x2000UL
#define USBHSDEV_DEV_CTL_INTR_SET_DPSLP_MASKED_Pos 14UL
#define USBHSDEV_DEV_CTL_INTR_SET_DPSLP_MASKED_Msk 0x4000UL
#define USBHSDEV_DEV_CTL_INTR_SET_PID_MISMATCH_ON_NAK_MASKED_Pos 15UL
#define USBHSDEV_DEV_CTL_INTR_SET_PID_MISMATCH_ON_NAK_MASKED_Msk 0x8000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_INTR_MASK */
#define USBHSDEV_DEV_EP_INTR_MASK_EP_IN_Pos 0UL
#define USBHSDEV_DEV_EP_INTR_MASK_EP_IN_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_INTR_MASK_EP_OUT_Pos 16UL
#define USBHSDEV_DEV_EP_INTR_MASK_EP_OUT_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_INTR */
#define USBHSDEV_DEV_EP_INTR_EP_IN_Pos 0UL
#define USBHSDEV_DEV_EP_INTR_EP_IN_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_INTR_EP_OUT_Pos 16UL
#define USBHSDEV_DEV_EP_INTR_EP_OUT_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_INTR_MASKED */
#define USBHSDEV_DEV_EP_INTR_MASKED_EP_IN_Pos 0UL
#define USBHSDEV_DEV_EP_INTR_MASKED_EP_IN_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_INTR_MASKED_EP_OUT_Pos 16UL
#define USBHSDEV_DEV_EP_INTR_MASKED_EP_OUT_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_INTR_SET */
#define USBHSDEV_DEV_EP_INTR_SET_EP_IN_Pos 0UL
#define USBHSDEV_DEV_EP_INTR_SET_EP_IN_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_INTR_SET_EP_OUT_Pos 16UL
#define USBHSDEV_DEV_EP_INTR_SET_EP_OUT_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_INGRS_INTR_MASK */
#define USBHSDEV_DEV_EP_INGRS_INTR_MASK_EP_INGRS_ZLP_RCVD_Pos 0UL
#define USBHSDEV_DEV_EP_INGRS_INTR_MASK_EP_INGRS_ZLP_RCVD_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_INGRS_INTR_MASK_EP_INGRS_SLP_RCVD_Pos 16UL
#define USBHSDEV_DEV_EP_INGRS_INTR_MASK_EP_INGRS_SLP_RCVD_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_INGRS_INTR */
#define USBHSDEV_DEV_EP_INGRS_INTR_EP_INGRS_ZLP_RCVD_Pos 0UL
#define USBHSDEV_DEV_EP_INGRS_INTR_EP_INGRS_ZLP_RCVD_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_INGRS_INTR_EP_INGRS_SLP_RCVD_Pos 16UL
#define USBHSDEV_DEV_EP_INGRS_INTR_EP_INGRS_SLP_RCVD_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_INGRS_INTR_MASKED */
#define USBHSDEV_DEV_EP_INGRS_INTR_MASKED_EP_INGRS_ZLP_RCVD_Pos 0UL
#define USBHSDEV_DEV_EP_INGRS_INTR_MASKED_EP_INGRS_ZLP_RCVD_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_INGRS_INTR_MASKED_EP_INGRS_SLP_RCVD_Pos 16UL
#define USBHSDEV_DEV_EP_INGRS_INTR_MASKED_EP_INGRS_SLP_RCVD_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_INGRS_INTR_SET */
#define USBHSDEV_DEV_EP_INGRS_INTR_SET_EP_INGRS_ZLP_RCVD_Pos 0UL
#define USBHSDEV_DEV_EP_INGRS_INTR_SET_EP_INGRS_ZLP_RCVD_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_INGRS_INTR_SET_EP_INGRS_SLP_RCVD_Pos 16UL
#define USBHSDEV_DEV_EP_INGRS_INTR_SET_EP_INGRS_SLP_RCVD_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_EGRS_REQ */
#define USBHSDEV_DEV_EP_EGRS_REQ_EP_EGRS_ZLP_SENT_Pos 0UL
#define USBHSDEV_DEV_EP_EGRS_REQ_EP_EGRS_ZLP_SENT_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_EGRS_REQ_EP_EGRS_SLP_SENT_Pos 16UL
#define USBHSDEV_DEV_EP_EGRS_REQ_EP_EGRS_SLP_SENT_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_EGRS_INTR_MASK */
#define USBHSDEV_DEV_EP_EGRS_INTR_MASK_EP_EGRS_ZLP_SENT_Pos 0UL
#define USBHSDEV_DEV_EP_EGRS_INTR_MASK_EP_EGRS_ZLP_SENT_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_EGRS_INTR_MASK_EP_EGRS_SLP_SENT_Pos 16UL
#define USBHSDEV_DEV_EP_EGRS_INTR_MASK_EP_EGRS_SLP_SENT_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_EGRS_INTR */
#define USBHSDEV_DEV_EP_EGRS_INTR_EP_EGRS_ZLP_SENT_Pos 0UL
#define USBHSDEV_DEV_EP_EGRS_INTR_EP_EGRS_ZLP_SENT_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_EGRS_INTR_EP_EGRS_SLP_SENT_Pos 16UL
#define USBHSDEV_DEV_EP_EGRS_INTR_EP_EGRS_SLP_SENT_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_EGRS_INTR_MASKED */
#define USBHSDEV_DEV_EP_EGRS_INTR_MASKED_EP_EGRS_ZLP_SENT_Pos 0UL
#define USBHSDEV_DEV_EP_EGRS_INTR_MASKED_EP_EGRS_ZLP_SENT_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_EGRS_INTR_MASKED_EP_EGRS_SLP_SENT_Pos 16UL
#define USBHSDEV_DEV_EP_EGRS_INTR_MASKED_EP_EGRS_SLP_SENT_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_EP_EGRS_INTR_SET */
#define USBHSDEV_DEV_EP_EGRS_INTR_SET_EP_EGRS_ZLP_SENT_Pos 0UL
#define USBHSDEV_DEV_EP_EGRS_INTR_SET_EP_EGRS_ZLP_SENT_Msk 0xFFFFUL
#define USBHSDEV_DEV_EP_EGRS_INTR_SET_EP_EGRS_SLP_SENT_Pos 16UL
#define USBHSDEV_DEV_EP_EGRS_INTR_SET_EP_EGRS_SLP_SENT_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.POWER */
#define USBHSDEV_POWER_RESETN_Pos 0UL
#define USBHSDEV_POWER_RESETN_Msk 0x1UL
#define USBHSDEV_POWER_EPM_DCG_ENABLE_Pos 1UL
#define USBHSDEV_POWER_EPM_DCG_ENABLE_Msk 0x2UL
#define USBHSDEV_POWER_AHB2AHB_SCALING_EN_Pos 2UL
#define USBHSDEV_POWER_AHB2AHB_SCALING_EN_Msk 0x4UL
#define USBHSDEV_POWER_LPM_ENABLE_Pos 3UL
#define USBHSDEV_POWER_LPM_ENABLE_Msk 0x8UL
#define USBHSDEV_POWER_VBUS_VALID_Pos 4UL
#define USBHSDEV_POWER_VBUS_VALID_Msk 0x10UL
#define USBHSDEV_POWER_REFCLK_SEL_Pos 5UL
#define USBHSDEV_POWER_REFCLK_SEL_Msk 0x20UL
/* MXS40USBHSDEV_USBHSDEV.DEV_LPM_ATTR */
#define USBHSDEV_DEV_LPM_ATTR_RMT_WAKEUP_ENABLE_Pos 0UL
#define USBHSDEV_DEV_LPM_ATTR_RMT_WAKEUP_ENABLE_Msk 0x1UL
#define USBHSDEV_DEV_LPM_ATTR_HIRD_Pos 1UL
#define USBHSDEV_DEV_LPM_ATTR_HIRD_Msk 0x1EUL
#define USBHSDEV_DEV_LPM_ATTR_NYET_Pos 5UL
#define USBHSDEV_DEV_LPM_ATTR_NYET_Msk 0x20UL
#define USBHSDEV_DEV_LPM_ATTR_T_L1_TOKEN_RETRY_Pos 8UL
#define USBHSDEV_DEV_LPM_ATTR_T_L1_TOKEN_RETRY_Msk 0xFFFF00UL
#define USBHSDEV_DEV_LPM_ATTR_L2_SUSP_RMT_WAKEUP_EN_Pos 31UL
#define USBHSDEV_DEV_LPM_ATTR_L2_SUSP_RMT_WAKEUP_EN_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_LPM_TIM_1 */
#define USBHSDEV_DEV_LPM_TIM_1_T_L1_DEV_DRV_RESUME_Pos 0UL
#define USBHSDEV_DEV_LPM_TIM_1_T_L1_DEV_DRV_RESUME_Msk 0xFFFFFUL
/* MXS40USBHSDEV_USBHSDEV.DEV_CHIRP_OVERRIDE */
#define USBHSDEV_DEV_CHIRP_OVERRIDE_OVERRIDE_FSM_Pos 0UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_OVERRIDE_FSM_Msk 0x1UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_CHIRP_K_Pos 1UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_CHIRP_K_Msk 0x2UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_CHIRP_J_Pos 2UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_CHIRP_J_Msk 0x4UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_STATE_Pos 3UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_STATE_Msk 0xF8UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_SEND_TEST_PACKET_Pos 15UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_SEND_TEST_PACKET_Msk 0x8000UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_RCV_TEST_PACKET_Pos 16UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_RCV_TEST_PACKET_Msk 0x10000UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_TEST_PACKET_SPEED_Pos 17UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_TEST_PACKET_SPEED_Msk 0x20000UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_J_FS_Pos 18UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_J_FS_Msk 0x40000UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_K_FS_Pos 19UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_K_FS_Msk 0x80000UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_J_HS_Pos 20UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_J_HS_Msk 0x100000UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_K_HS_Pos 21UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_K_HS_Msk 0x200000UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_J_NO45_Pos 22UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_J_NO45_Msk 0x400000UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_K_NO45_Pos 23UL
#define USBHSDEV_DEV_CHIRP_OVERRIDE_FORCE_K_NO45_Msk 0x800000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_TIM_T_DCHSE0 */
#define USBHSDEV_DEV_TIM_T_DCHSE0_T_DCHSE0_Pos 0UL
#define USBHSDEV_DEV_TIM_T_DCHSE0_T_DCHSE0_Msk 0x3FFFUL
#define USBHSDEV_DEV_TIM_T_DCHSE0_T_IPG_Pos 16UL
#define USBHSDEV_DEV_TIM_T_DCHSE0_T_IPG_Msk 0x1F0000UL
#define USBHSDEV_DEV_TIM_T_DCHSE0_T_HST_DBOUNCE_Pos 22UL
#define USBHSDEV_DEV_TIM_T_DCHSE0_T_HST_DBOUNCE_Msk 0x7FC00000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_TIM_T_DETRST_FILT */
#define USBHSDEV_DEV_TIM_T_DETRST_FILT_T_DETRST_Pos 0UL
#define USBHSDEV_DEV_TIM_T_DETRST_FILT_T_DETRST_Msk 0xFFFFFUL
#define USBHSDEV_DEV_TIM_T_DETRST_FILT_T_FILT_Pos 20UL
#define USBHSDEV_DEV_TIM_T_DETRST_FILT_T_FILT_Msk 0xFFF00000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_TIM_T_WTFS */
#define USBHSDEV_DEV_TIM_T_WTFS_T_WTFS_Pos 0UL
#define USBHSDEV_DEV_TIM_T_WTFS_T_WTFS_Msk 0x1FFFFUL
/* MXS40USBHSDEV_USBHSDEV.DEV_TIM_T_SUSP */
#define USBHSDEV_DEV_TIM_T_SUSP_T_SUSP_Pos 0UL
#define USBHSDEV_DEV_TIM_T_SUSP_T_SUSP_Msk 0x1FFFFUL
/* MXS40USBHSDEV_USBHSDEV.DEV_TIM_T_WTRSTHS */
#define USBHSDEV_DEV_TIM_T_WTRSTHS_T_WTRSTHS_Pos 0UL
#define USBHSDEV_DEV_TIM_T_WTRSTHS_T_WTRSTHS_Msk 0xFFFFUL
/* MXS40USBHSDEV_USBHSDEV.DEV_TIM_T_UCH */
#define USBHSDEV_DEV_TIM_T_UCH_T_UCH_Pos 0UL
#define USBHSDEV_DEV_TIM_T_UCH_T_UCH_Msk 0x1FFFFUL
/* MXS40USBHSDEV_USBHSDEV.DEV_TIM_T_WTREV_WTRSTFS */
#define USBHSDEV_DEV_TIM_T_WTREV_WTRSTFS_T_WTREV_WTRSTFS_Pos 0UL
#define USBHSDEV_DEV_TIM_T_WTREV_WTRSTFS_T_WTREV_WTRSTFS_Msk 0x1FFFFUL
/* MXS40USBHSDEV_USBHSDEV.DDFT_CONFIG */
#define USBHSDEV_DDFT_CONFIG_DDFT0_SEL_Pos 0UL
#define USBHSDEV_DDFT_CONFIG_DDFT0_SEL_Msk 0x7FUL
#define USBHSDEV_DDFT_CONFIG_DDFT0_POLARITY_Pos 15UL
#define USBHSDEV_DDFT_CONFIG_DDFT0_POLARITY_Msk 0x8000UL
#define USBHSDEV_DDFT_CONFIG_DDFT1_SEL_Pos 16UL
#define USBHSDEV_DDFT_CONFIG_DDFT1_SEL_Msk 0x7F0000UL
#define USBHSDEV_DDFT_CONFIG_DDFT1_POLARITY_Pos 31UL
#define USBHSDEV_DDFT_CONFIG_DDFT1_POLARITY_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_LOOPBACK_CTRL */
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_EN_Pos 0UL
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_EN_Msk 0x1UL
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_START_Pos 1UL
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_START_Msk 0x2UL
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_START_INTR_Pos 2UL
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_START_INTR_Msk 0x4UL
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_START_MASK_Pos 3UL
