RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_mxs40usbhsdev.h
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_START_MASK_Msk 0x8UL
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_START_MASKED_Pos 4UL
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_START_MASKED_Msk 0x10UL
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_START_SW_SET_Pos 5UL
#define USBHSDEV_DEV_LOOPBACK_CTRL_LPBK_START_SW_SET_Msk 0x20UL
/* MXS40USBHSDEV_USBHSDEV.DEV_LOOPBACK_IN_REQ */
#define USBHSDEV_DEV_LOOPBACK_IN_REQ_IN_TOKEN_Pos 0UL
#define USBHSDEV_DEV_LOOPBACK_IN_REQ_IN_TOKEN_Msk 0xFFFFFFUL
/* MXS40USBHSDEV_USBHSDEV.DEV_LOOPBACK_OUT_REQ */
#define USBHSDEV_DEV_LOOPBACK_OUT_REQ_OUT_TOKEN_Pos 0UL
#define USBHSDEV_DEV_LOOPBACK_OUT_REQ_OUT_TOKEN_Msk 0xFFFFFFUL
/* MXS40USBHSDEV_USBHSDEV.EPM_CS */
#define USBHSDEV_EPM_CS_EGRS_FORCE_FLUSH_ALL_Pos 0UL
#define USBHSDEV_EPM_CS_EGRS_FORCE_FLUSH_ALL_Msk 0x1UL
#define USBHSDEV_EPM_CS_IGRS_FORCE_FLUSH_ALL_Pos 1UL
#define USBHSDEV_EPM_CS_IGRS_FORCE_FLUSH_ALL_Msk 0x2UL
#define USBHSDEV_EPM_CS_ALLOW_TRIG_ON_SLP_Pos 2UL
#define USBHSDEV_EPM_CS_ALLOW_TRIG_ON_SLP_Msk 0x4UL
/* MXS40USBHSDEV_USBHSDEV.EEPM_DEBUG */
#define USBHSDEV_EEPM_DEBUG_C_EPNUM_Pos 0UL
#define USBHSDEV_EEPM_DEBUG_C_EPNUM_Msk 0xFUL
#define USBHSDEV_EEPM_DEBUG_C_REQUEST_Pos 4UL
#define USBHSDEV_EEPM_DEBUG_C_REQUEST_Msk 0x30UL
#define USBHSDEV_EEPM_DEBUG_USB_RD_ADDR_Pos 6UL
#define USBHSDEV_EEPM_DEBUG_USB_RD_ADDR_Msk 0x7FFC0UL
#define USBHSDEV_EEPM_DEBUG_AHB_WR_ADDR_Pos 19UL
#define USBHSDEV_EEPM_DEBUG_AHB_WR_ADDR_Msk 0xFFF80000UL
/* MXS40USBHSDEV_USBHSDEV.IEPM_DEBUG */
#define USBHSDEV_IEPM_DEBUG_ACTIVE_EP_NUM_Pos 0UL
#define USBHSDEV_IEPM_DEBUG_ACTIVE_EP_NUM_Msk 0xFUL
#define USBHSDEV_IEPM_DEBUG_P_REQUESTS_Pos 4UL
#define USBHSDEV_IEPM_DEBUG_P_REQUESTS_Msk 0x3F0UL
#define USBHSDEV_IEPM_DEBUG_P_REQ_EP_NUM_Pos 16UL
#define USBHSDEV_IEPM_DEBUG_P_REQ_EP_NUM_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.IEPM_DEBUG_1 */
#define USBHSDEV_IEPM_DEBUG_1_IGRS_USB_WADDR_Pos 0UL
#define USBHSDEV_IEPM_DEBUG_1_IGRS_USB_WADDR_Msk 0x1FFUL
#define USBHSDEV_IEPM_DEBUG_1_IGRS_AHB_RADDR_Pos 16UL
#define USBHSDEV_IEPM_DEBUG_1_IGRS_AHB_RADDR_Msk 0x1FF0000UL
/* MXS40USBHSDEV_USBHSDEV.IEPM_DEBUG_2 */
#define USBHSDEV_IEPM_DEBUG_2_IGRS_LAST_WADDR_Pos 0UL
#define USBHSDEV_IEPM_DEBUG_2_IGRS_LAST_WADDR_Msk 0x1FFUL
#define USBHSDEV_IEPM_DEBUG_2_IGRS_LAST_RADDR_Pos 16UL
#define USBHSDEV_IEPM_DEBUG_2_IGRS_LAST_RADDR_Msk 0x1FF0000UL
/* MXS40USBHSDEV_USBHSDEV.EEPM_ENDPOINT */
#define USBHSDEV_EEPM_ENDPOINT_EGRS_SLP_BYTE_COUNT_Pos 0UL
#define USBHSDEV_EEPM_ENDPOINT_EGRS_SLP_BYTE_COUNT_Msk 0x3FFUL
#define USBHSDEV_EEPM_ENDPOINT_EGRS_FLUSH_EP_Pos 11UL
#define USBHSDEV_EEPM_ENDPOINT_EGRS_FLUSH_EP_Msk 0x800UL
/* MXS40USBHSDEV_USBHSDEV.IEPM_ENDPOINT */
#define USBHSDEV_IEPM_ENDPOINT_INGRS_SLP_BYTE_COUNT_Pos 0UL
#define USBHSDEV_IEPM_ENDPOINT_INGRS_SLP_BYTE_COUNT_Msk 0x3FFUL
#define USBHSDEV_IEPM_ENDPOINT_ALLOW_NAK_TILL_DMA_RDY_Pos 11UL
#define USBHSDEV_IEPM_ENDPOINT_ALLOW_NAK_TILL_DMA_RDY_Msk 0x800UL
/* MXS40USBHSDEV_USBHSDEV.EEPM_DEBUG_ENDPOINT */
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EGRS_P_REQUESTS_Pos 0UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EGRS_P_REQUESTS_Msk 0x3UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EGRS_DMA_TRIGGERED_Pos 2UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EGRS_DMA_TRIGGERED_Msk 0x4UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EP_NEXT_ADDR_Pos 3UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EP_NEXT_ADDR_Msk 0xFFF8UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EP_CURR_ADDR_Pos 16UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EP_CURR_ADDR_Msk 0x1FFF0000UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EP_NEXT_SLP_Pos 29UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EP_NEXT_SLP_Msk 0x20000000UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EP_CURR_SLP_Pos 30UL
#define USBHSDEV_EEPM_DEBUG_ENDPOINT_EP_CURR_SLP_Msk 0x40000000UL
/* MXS40USBHSDEV_USBHSDEV.IEPM_DEBUG_ENDPOINT */
#define USBHSDEV_IEPM_DEBUG_ENDPOINT_INGRS_DMA_TRIGGERED_Pos 0UL
#define USBHSDEV_IEPM_DEBUG_ENDPOINT_INGRS_DMA_TRIGGERED_Msk 0x1UL
/* MXS40USBHSDEV_USBHSDEV.MMIO_EEPM_ENDPOINT */
#define USBHSDEV_MMIO_EEPM_ENDPOINT_EGRS_IF_SELECT_Pos 0UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_EGRS_IF_SELECT_Msk 0x1UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_MMIO_EGRS_TR_SEND_Pos 1UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_MMIO_EGRS_TR_SEND_Msk 0x2UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_MMIO_EGRS_TR_RCV_Pos 2UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_MMIO_EGRS_TR_RCV_Msk 0x4UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_MMIO_EGRS_TR_RCV_MASK_Pos 3UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_MMIO_EGRS_TR_RCV_MASK_Msk 0x8UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_MMIO_EGRS_TR_RCV_MASKED_Pos 4UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_MMIO_EGRS_TR_RCV_MASKED_Msk 0x10UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_MMIO_EGRS_TR_RCV_SW_SET_Pos 5UL
#define USBHSDEV_MMIO_EEPM_ENDPOINT_MMIO_EGRS_TR_RCV_SW_SET_Msk 0x20UL
/* MXS40USBHSDEV_USBHSDEV.MMIO_IEPM_ENDPOINT */
#define USBHSDEV_MMIO_IEPM_ENDPOINT_INGRS_IF_SELECT_Pos 0UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_INGRS_IF_SELECT_Msk 0x1UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_MMIO_IGRS_TR_SEND_Pos 1UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_MMIO_IGRS_TR_SEND_Msk 0x2UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_MMIO_IGRS_TR_RCV_Pos 2UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_MMIO_IGRS_TR_RCV_Msk 0x4UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_MMIO_IGRS_TR_RCV_MASK_Pos 3UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_MMIO_IGRS_TR_RCV_MASK_Msk 0x8UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_MMIO_IGRS_TR_RCV_MASKED_Pos 4UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_MMIO_IGRS_TR_RCV_MASKED_Msk 0x10UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_MMIO_IGRS_TR_RCV_SW_SET_Pos 5UL
#define USBHSDEV_MMIO_IEPM_ENDPOINT_MMIO_IGRS_TR_RCV_SW_SET_Msk 0x20UL
/* MXS40USBHSDEV_USBHSDEV.DEV_SPARE_1 */
#define USBHSDEV_DEV_SPARE_1_SPARE_1_1_Pos 0UL
#define USBHSDEV_DEV_SPARE_1_SPARE_1_1_Msk 0xFFFFUL
#define USBHSDEV_DEV_SPARE_1_SPARE_1_2_Pos 16UL
#define USBHSDEV_DEV_SPARE_1_SPARE_1_2_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.DEV_SPARE_2 */
#define USBHSDEV_DEV_SPARE_2_SPARE_2_1_Pos 0UL
#define USBHSDEV_DEV_SPARE_2_SPARE_2_1_Msk 0xFFFFUL
#define USBHSDEV_DEV_SPARE_2_SPARE_2_2_Pos 16UL
#define USBHSDEV_DEV_SPARE_2_SPARE_2_2_Msk 0xFFFF0000UL
/* MXS40USBHSDEV_USBHSDEV.LEGACY_FEATURE_ENABLE */
#define USBHSDEV_LEGACY_FEATURE_ENABLE_DATA0_TOG_UPON_STALL_Pos 0UL
#define USBHSDEV_LEGACY_FEATURE_ENABLE_DATA0_TOG_UPON_STALL_Msk 0x1UL
#define USBHSDEV_LEGACY_FEATURE_ENABLE_CONT_LP_UPON_NO_HOST_RSUME_Pos 1UL
#define USBHSDEV_LEGACY_FEATURE_ENABLE_CONT_LP_UPON_NO_HOST_RSUME_Msk 0x2UL
#define USBHSDEV_LEGACY_FEATURE_ENABLE_NO_PID_UPDATE_ON_NAK_Pos 2UL
#define USBHSDEV_LEGACY_FEATURE_ENABLE_NO_PID_UPDATE_ON_NAK_Msk 0x4UL
#define USBHSDEV_LEGACY_FEATURE_ENABLE_RESERVED_Pos 3UL
#define USBHSDEV_LEGACY_FEATURE_ENABLE_RESERVED_Msk 0xFFFFFFF8UL
/* MXS40USBHSDEV_USBHSDEV.DFT_OBSERVE */
#define USBHSDEV_DFT_OBSERVE_DFT_OBSERVE_Pos 0UL
#define USBHSDEV_DFT_OBSERVE_DFT_OBSERVE_Msk 0xFFFFFFFFUL


