RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_mxs40usbhsdev.h
/* MXS40USBHSDEV_USBHSPHY.AFE_CONTROL_1 */
#define USBHSPHY_AFE_CONTROL_1_HS_PRED_DP_SEL_Pos 0UL
#define USBHSPHY_AFE_CONTROL_1_HS_PRED_DP_SEL_Msk 0x3UL
#define USBHSPHY_AFE_CONTROL_1_HS_PRED_DN_SEL_Pos 2UL
#define USBHSPHY_AFE_CONTROL_1_HS_PRED_DN_SEL_Msk 0xCUL
#define USBHSPHY_AFE_CONTROL_1_HS_AMP_SEL_Pos 4UL
#define USBHSPHY_AFE_CONTROL_1_HS_AMP_SEL_Msk 0xF0UL
#define USBHSPHY_AFE_CONTROL_1_HS_PREE_SEL_Pos 8UL
#define USBHSPHY_AFE_CONTROL_1_HS_PREE_SEL_Msk 0x700UL
#define USBHSPHY_AFE_CONTROL_1_HS_SR_FINE_SEL_Pos 11UL
#define USBHSPHY_AFE_CONTROL_1_HS_SR_FINE_SEL_Msk 0x3800UL
#define USBHSPHY_AFE_CONTROL_1_HS_TED_LP_MODE_Pos 14UL
#define USBHSPHY_AFE_CONTROL_1_HS_TED_LP_MODE_Msk 0x4000UL
#define USBHSPHY_AFE_CONTROL_1_EN_LANE_SWAP_Pos 15UL
#define USBHSPHY_AFE_CONTROL_1_EN_LANE_SWAP_Msk 0x8000UL
#define USBHSPHY_AFE_CONTROL_1_HS_CTLE_SEL_Pos 16UL
#define USBHSPHY_AFE_CONTROL_1_HS_CTLE_SEL_Msk 0x70000UL
#define USBHSPHY_AFE_CONTROL_1_FS_VTRIG_SEL_Pos 19UL
#define USBHSPHY_AFE_CONTROL_1_FS_VTRIG_SEL_Msk 0x380000UL
#define USBHSPHY_AFE_CONTROL_1_FS_SR_SEL_Pos 22UL
#define USBHSPHY_AFE_CONTROL_1_FS_SR_SEL_Msk 0x3C00000UL
#define USBHSPHY_AFE_CONTROL_1_LS_SR_SEL_Pos 26UL
#define USBHSPHY_AFE_CONTROL_1_LS_SR_SEL_Msk 0xC000000UL
#define USBHSPHY_AFE_CONTROL_1_HS_LB_EN_Pos 28UL
#define USBHSPHY_AFE_CONTROL_1_HS_LB_EN_Msk 0x10000000UL
#define USBHSPHY_AFE_CONTROL_1_HS_TED_25_MODE_Pos 29UL
#define USBHSPHY_AFE_CONTROL_1_HS_TED_25_MODE_Msk 0x20000000UL
#define USBHSPHY_AFE_CONTROL_1_CPU_DELAY_ENABLE_VCCD_Pos 30UL
#define USBHSPHY_AFE_CONTROL_1_CPU_DELAY_ENABLE_VCCD_Msk 0x40000000UL
#define USBHSPHY_AFE_CONTROL_1_CPU_DELAY_ENABLE_HS_VCCD_Pos 31UL
#define USBHSPHY_AFE_CONTROL_1_CPU_DELAY_ENABLE_HS_VCCD_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSPHY.AFE_CONTROL_2 */
#define USBHSPHY_AFE_CONTROL_2_AFE_DFT_SEL_Pos 0UL
#define USBHSPHY_AFE_CONTROL_2_AFE_DFT_SEL_Msk 0x3FFUL
#define USBHSPHY_AFE_CONTROL_2_EUSB_RX_CRUDE_EN_Pos 10UL
#define USBHSPHY_AFE_CONTROL_2_EUSB_RX_CRUDE_EN_Msk 0x400UL
#define USBHSPHY_AFE_CONTROL_2_EUSB_RX_MUX_SEL_Pos 11UL
#define USBHSPHY_AFE_CONTROL_2_EUSB_RX_MUX_SEL_Msk 0x800UL
#define USBHSPHY_AFE_CONTROL_2_EUSB_RX_OVERRIDE_Pos 12UL
#define USBHSPHY_AFE_CONTROL_2_EUSB_RX_OVERRIDE_Msk 0x1000UL
#define USBHSPHY_AFE_CONTROL_2_EUSB_RX_MISSION_EN_Pos 13UL
#define USBHSPHY_AFE_CONTROL_2_EUSB_RX_MISSION_EN_Msk 0x2000UL
#define USBHSPHY_AFE_CONTROL_2_SE_RX_SE1_FILTER_EN_N_Pos 14UL
#define USBHSPHY_AFE_CONTROL_2_SE_RX_SE1_FILTER_EN_N_Msk 0x4000UL
#define USBHSPHY_AFE_CONTROL_2_ENABLE_EUSB_RX_Pos 17UL
#define USBHSPHY_AFE_CONTROL_2_ENABLE_EUSB_RX_Msk 0x20000UL
/* MXS40USBHSDEV_USBHSPHY.UTMI_CONTROL */
#define USBHSPHY_UTMI_CONTROL_SOFT_DISCONNECT_N_Pos 0UL
#define USBHSPHY_UTMI_CONTROL_SOFT_DISCONNECT_N_Msk 0x1UL
#define USBHSPHY_UTMI_CONTROL_VLOAD_Pos 1UL
#define USBHSPHY_UTMI_CONTROL_VLOAD_Msk 0x2UL
#define USBHSPHY_UTMI_CONTROL_VCONTROL_TESTCODE_Pos 2UL
#define USBHSPHY_UTMI_CONTROL_VCONTROL_TESTCODE_Msk 0x3CUL
#define USBHSPHY_UTMI_CONTROL_VCONTROL_TESTDATA_Pos 6UL
#define USBHSPHY_UTMI_CONTROL_VCONTROL_TESTDATA_Msk 0x3C0UL
#define USBHSPHY_UTMI_CONTROL_BIST_EN_Pos 10UL
#define USBHSPHY_UTMI_CONTROL_BIST_EN_Msk 0x400UL
#define USBHSPHY_UTMI_CONTROL_TUNE_BYPASS_EN_Pos 11UL
#define USBHSPHY_UTMI_CONTROL_TUNE_BYPASS_EN_Msk 0x800UL
#define USBHSPHY_UTMI_CONTROL_EXT_CAL_VALUE_Pos 12UL
#define USBHSPHY_UTMI_CONTROL_EXT_CAL_VALUE_Msk 0x1F000UL
#define USBHSPHY_UTMI_CONTROL_OTG_IN_SUSPEND_Pos 17UL
#define USBHSPHY_UTMI_CONTROL_OTG_IN_SUSPEND_Msk 0x20000UL
#define USBHSPHY_UTMI_CONTROL_BIST_CONTINOUS_EN_Pos 18UL
#define USBHSPHY_UTMI_CONTROL_BIST_CONTINOUS_EN_Msk 0x40000UL
#define USBHSPHY_UTMI_CONTROL_LINESTATE_COMBO_SEQ_Pos 19UL
#define USBHSPHY_UTMI_CONTROL_LINESTATE_COMBO_SEQ_Msk 0x80000UL
#define USBHSPHY_UTMI_CONTROL_LINESTATE_EXT_SEL_Pos 20UL
#define USBHSPHY_UTMI_CONTROL_LINESTATE_EXT_SEL_Msk 0x100000UL
#define USBHSPHY_UTMI_CONTROL_LINESTATE_CLK_SEL_Pos 21UL
#define USBHSPHY_UTMI_CONTROL_LINESTATE_CLK_SEL_Msk 0x200000UL
#define USBHSPHY_UTMI_CONTROL_CAL_BIG_LITTLE_ENDIAN_Pos 22UL
#define USBHSPHY_UTMI_CONTROL_CAL_BIG_LITTLE_ENDIAN_Msk 0x400000UL
#define USBHSPHY_UTMI_CONTROL_BIST_CONTINOUS_PATTERN_Pos 23UL
#define USBHSPHY_UTMI_CONTROL_BIST_CONTINOUS_PATTERN_Msk 0x7F800000UL
#define USBHSPHY_UTMI_CONTROL_REVERT_RPU_CTRL_Pos 31UL
#define USBHSPHY_UTMI_CONTROL_REVERT_RPU_CTRL_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSPHY.CDR_CONTROL */
#define USBHSPHY_CDR_CONTROL_CONF_EOI_VEC_Pos 0UL
#define USBHSPHY_CDR_CONTROL_CONF_EOI_VEC_Msk 0x7UL
#define USBHSPHY_CDR_CONTROL_CONF_HS_6_SYNC_Pos 3UL
#define USBHSPHY_CDR_CONTROL_CONF_HS_6_SYNC_Msk 0x8UL
#define USBHSPHY_CDR_CONTROL_EBUF_DEPTH_Pos 4UL
#define USBHSPHY_CDR_CONTROL_EBUF_DEPTH_Msk 0x30UL
#define USBHSPHY_CDR_CONTROL_CDR_CONFIG_1_Pos 6UL
#define USBHSPHY_CDR_CONTROL_CDR_CONFIG_1_Msk 0x40UL
#define USBHSPHY_CDR_CONTROL_CDR_ENABLE_Pos 7UL
#define USBHSPHY_CDR_CONTROL_CDR_ENABLE_Msk 0x80UL
#define USBHSPHY_CDR_CONTROL_SQUELCH_FILTER_Pos 8UL
#define USBHSPHY_CDR_CONTROL_SQUELCH_FILTER_Msk 0x700UL
#define USBHSPHY_CDR_CONTROL_SYNC_MATCH_PATTERN_Pos 11UL
#define USBHSPHY_CDR_CONTROL_SYNC_MATCH_PATTERN_Msk 0x800UL
#define USBHSPHY_CDR_CONTROL_GATE_SERIAL_IN_TILL_SQUELCH_Pos 12UL
#define USBHSPHY_CDR_CONTROL_GATE_SERIAL_IN_TILL_SQUELCH_Msk 0x1000UL
#define USBHSPHY_CDR_CONTROL_SERIAL_IN_DELAY_Pos 13UL
#define USBHSPHY_CDR_CONTROL_SERIAL_IN_DELAY_Msk 0xE000UL
/* MXS40USBHSDEV_USBHSPHY.BC_CONTROL */
#define USBHSPHY_BC_CONTROL_CHRGR_DET_ON_Pos 0UL
#define USBHSPHY_BC_CONTROL_CHRGR_DET_ON_Msk 0x1UL
#define USBHSPHY_BC_CONTROL_VDM_SRC_EN_Pos 1UL
#define USBHSPHY_BC_CONTROL_VDM_SRC_EN_Msk 0x2UL
#define USBHSPHY_BC_CONTROL_VDP_SRC_EN_Pos 2UL
#define USBHSPHY_BC_CONTROL_VDP_SRC_EN_Msk 0x4UL
/* MXS40USBHSDEV_USBHSPHY.PLL_CONTROL_1 */
#define USBHSPHY_PLL_CONTROL_1_RUN_AWAY_DEL_Pos 0UL
#define USBHSPHY_PLL_CONTROL_1_RUN_AWAY_DEL_Msk 0x3UL
#define USBHSPHY_PLL_CONTROL_1_RUN_AWAY_DIS_Pos 2UL
#define USBHSPHY_PLL_CONTROL_1_RUN_AWAY_DIS_Msk 0x4UL
#define USBHSPHY_PLL_CONTROL_1_VCO_GAIN_Pos 3UL
#define USBHSPHY_PLL_CONTROL_1_VCO_GAIN_Msk 0x78UL
#define USBHSPHY_PLL_CONTROL_1_PLL_EN_Pos 8UL
#define USBHSPHY_PLL_CONTROL_1_PLL_EN_Msk 0x100UL
#define USBHSPHY_PLL_CONTROL_1_SUPPLY_EN_Pos 9UL
#define USBHSPHY_PLL_CONTROL_1_SUPPLY_EN_Msk 0x200UL
#define USBHSPHY_PLL_CONTROL_1_LD_DELAY_Pos 10UL
#define USBHSPHY_PLL_CONTROL_1_LD_DELAY_Msk 0xC00UL
#define USBHSPHY_PLL_CONTROL_1_LDO_VCO_BYPASS_Pos 13UL
#define USBHSPHY_PLL_CONTROL_1_LDO_VCO_BYPASS_Msk 0x2000UL
#define USBHSPHY_PLL_CONTROL_1_P_DIV_Pos 14UL
#define USBHSPHY_PLL_CONTROL_1_P_DIV_Msk 0xC000UL
#define USBHSPHY_PLL_CONTROL_1_Q_DIV_Pos 16UL
#define USBHSPHY_PLL_CONTROL_1_Q_DIV_Msk 0x30000UL
#define USBHSPHY_PLL_CONTROL_1_PLL_SPARE_Pos 18UL
#define USBHSPHY_PLL_CONTROL_1_PLL_SPARE_Msk 0x40000UL
#define USBHSPHY_PLL_CONTROL_1_VCO_INIT_DIS_Pos 19UL
#define USBHSPHY_PLL_CONTROL_1_VCO_INIT_DIS_Msk 0x80000UL
#define USBHSPHY_PLL_CONTROL_1_ATST_SEL_Pos 20UL
#define USBHSPHY_PLL_CONTROL_1_ATST_SEL_Msk 0xF00000UL
#define USBHSPHY_PLL_CONTROL_1_CAL_UP_DN_Pos 24UL
#define USBHSPHY_PLL_CONTROL_1_CAL_UP_DN_Msk 0xF000000UL
#define USBHSPHY_PLL_CONTROL_1_RA_UP_TR_Pos 28UL
#define USBHSPHY_PLL_CONTROL_1_RA_UP_TR_Msk 0x30000000UL
/* MXS40USBHSDEV_USBHSPHY.PLL_CONTROL_2 */
#define USBHSPHY_PLL_CONTROL_2_EN_CPU_OVERIDE_PLL_LOCK_Pos 0UL
#define USBHSPHY_PLL_CONTROL_2_EN_CPU_OVERIDE_PLL_LOCK_Msk 0x1UL
#define USBHSPHY_PLL_CONTROL_2_CPU_OVERIDE_PLL_LOCK_VALUE_Pos 1UL
#define USBHSPHY_PLL_CONTROL_2_CPU_OVERIDE_PLL_LOCK_VALUE_Msk 0x2UL
#define USBHSPHY_PLL_CONTROL_2_SOURCE_OF_PLL_LOCK_Pos 2UL
#define USBHSPHY_PLL_CONTROL_2_SOURCE_OF_PLL_LOCK_Msk 0x4UL
#define USBHSPHY_PLL_CONTROL_2_LOCK_DELAY_Pos 3UL
#define USBHSPHY_PLL_CONTROL_2_LOCK_DELAY_Msk 0x7F8UL
#define USBHSPHY_PLL_CONTROL_2_LOSS_LOCK_DELAY_Pos 11UL
#define USBHSPHY_PLL_CONTROL_2_LOSS_LOCK_DELAY_Msk 0xF800UL
#define USBHSPHY_PLL_CONTROL_2_JITTER_TEST_MODE_Pos 16UL
#define USBHSPHY_PLL_CONTROL_2_JITTER_TEST_MODE_Msk 0x10000UL
#define USBHSPHY_PLL_CONTROL_2_DIV_VALUE_Pos 25UL
#define USBHSPHY_PLL_CONTROL_2_DIV_VALUE_Msk 0x1E000000UL
#define USBHSPHY_PLL_CONTROL_2_PLL_CLKOUT_DDFT_SEL_Pos 29UL
#define USBHSPHY_PLL_CONTROL_2_PLL_CLKOUT_DDFT_SEL_Msk 0xE0000000UL
/* MXS40USBHSDEV_USBHSPHY.TEST_PLL_CONTROL */
#define USBHSPHY_TEST_PLL_CONTROL_RUN_AWAY_DEL_Pos 0UL
#define USBHSPHY_TEST_PLL_CONTROL_RUN_AWAY_DEL_Msk 0x3UL
#define USBHSPHY_TEST_PLL_CONTROL_RUN_AWAY_DIS_Pos 2UL
#define USBHSPHY_TEST_PLL_CONTROL_RUN_AWAY_DIS_Msk 0x4UL
#define USBHSPHY_TEST_PLL_CONTROL_VCO_GAIN_Pos 3UL
#define USBHSPHY_TEST_PLL_CONTROL_VCO_GAIN_Msk 0x78UL
#define USBHSPHY_TEST_PLL_CONTROL_PLL_EN_Pos 8UL
#define USBHSPHY_TEST_PLL_CONTROL_PLL_EN_Msk 0x100UL
#define USBHSPHY_TEST_PLL_CONTROL_SUPPLY_EN_Pos 9UL
#define USBHSPHY_TEST_PLL_CONTROL_SUPPLY_EN_Msk 0x200UL
#define USBHSPHY_TEST_PLL_CONTROL_LD_DELAY_Pos 10UL
#define USBHSPHY_TEST_PLL_CONTROL_LD_DELAY_Msk 0xC00UL
#define USBHSPHY_TEST_PLL_CONTROL_LDO_VCO_BYPASS_Pos 13UL
#define USBHSPHY_TEST_PLL_CONTROL_LDO_VCO_BYPASS_Msk 0x2000UL
#define USBHSPHY_TEST_PLL_CONTROL_P_DIV_Pos 14UL
#define USBHSPHY_TEST_PLL_CONTROL_P_DIV_Msk 0xC000UL
#define USBHSPHY_TEST_PLL_CONTROL_Q_DIV_Pos 16UL
#define USBHSPHY_TEST_PLL_CONTROL_Q_DIV_Msk 0x30000UL
#define USBHSPHY_TEST_PLL_CONTROL_PLL_SPARE_Pos 18UL
#define USBHSPHY_TEST_PLL_CONTROL_PLL_SPARE_Msk 0x40000UL
#define USBHSPHY_TEST_PLL_CONTROL_VCO_INIT_DIS_Pos 19UL
#define USBHSPHY_TEST_PLL_CONTROL_VCO_INIT_DIS_Msk 0x80000UL
#define USBHSPHY_TEST_PLL_CONTROL_ATST_SEL_Pos 20UL
#define USBHSPHY_TEST_PLL_CONTROL_ATST_SEL_Msk 0xF00000UL
#define USBHSPHY_TEST_PLL_CONTROL_CAL_UP_DN_Pos 24UL
#define USBHSPHY_TEST_PLL_CONTROL_CAL_UP_DN_Msk 0xF000000UL
#define USBHSPHY_TEST_PLL_CONTROL_RA_UP_TR_Pos 28UL
#define USBHSPHY_TEST_PLL_CONTROL_RA_UP_TR_Msk 0x30000000UL
#define USBHSPHY_TEST_PLL_CONTROL_TEST_LOCK_DELAY_Pos 30UL
#define USBHSPHY_TEST_PLL_CONTROL_TEST_LOCK_DELAY_Msk 0xC0000000UL
/* MXS40USBHSDEV_USBHSPHY.TEST_CONTROL */
#define USBHSPHY_TEST_CONTROL_RUN_CALIBRATION_Pos 0UL
#define USBHSPHY_TEST_CONTROL_RUN_CALIBRATION_Msk 0x1UL
#define USBHSPHY_TEST_CONTROL_CALIBRATED_VALUE_Pos 1UL
#define USBHSPHY_TEST_CONTROL_CALIBRATED_VALUE_Msk 0x3EUL
/* MXS40USBHSDEV_USBHSPHY.DDFT_CFG */
#define USBHSPHY_DDFT_CFG_DDFT0_SEL_Pos 0UL
#define USBHSPHY_DDFT_CFG_DDFT0_SEL_Msk 0x7FUL
#define USBHSPHY_DDFT_CFG_DDFT0_POLARITY_Pos 7UL
#define USBHSPHY_DDFT_CFG_DDFT0_POLARITY_Msk 0x80UL
#define USBHSPHY_DDFT_CFG_DDFT1_SEL_Pos 8UL
#define USBHSPHY_DDFT_CFG_DDFT1_SEL_Msk 0x7F00UL
#define USBHSPHY_DDFT_CFG_DDFT1_POLARITY_Pos 15UL
#define USBHSPHY_DDFT_CFG_DDFT1_POLARITY_Msk 0x8000UL
/* MXS40USBHSDEV_USBHSPHY.DIGITAL_CONTROL */
#define USBHSPHY_DIGITAL_CONTROL_DLAUNCH_SEL_Pos 0UL
#define USBHSPHY_DIGITAL_CONTROL_DLAUNCH_SEL_Msk 0x3UL
#define USBHSPHY_DIGITAL_CONTROL_TX_CLOCK_SOURCE_DFT_Pos 2UL
#define USBHSPHY_DIGITAL_CONTROL_TX_CLOCK_SOURCE_DFT_Msk 0x4UL
#define USBHSPHY_DIGITAL_CONTROL_CLK480_PHASE_SEL_Pos 3UL
#define USBHSPHY_DIGITAL_CONTROL_CLK480_PHASE_SEL_Msk 0x8UL
#define USBHSPHY_DIGITAL_CONTROL_DLAUNCH_ON_DELAY_Pos 5UL
#define USBHSPHY_DIGITAL_CONTROL_DLAUNCH_ON_DELAY_Msk 0xE0UL
#define USBHSPHY_DIGITAL_CONTROL_DLAUNCH_OFF_DELAY_Pos 8UL
#define USBHSPHY_DIGITAL_CONTROL_DLAUNCH_OFF_DELAY_Msk 0x700UL
#define USBHSPHY_DIGITAL_CONTROL_BURN_IN_EN_Pos 11UL
#define USBHSPHY_DIGITAL_CONTROL_BURN_IN_EN_Msk 0x800UL
#define USBHSPHY_DIGITAL_CONTROL_BURN_Pos 12UL
#define USBHSPHY_DIGITAL_CONTROL_BURN_Msk 0x3000UL
#define USBHSPHY_DIGITAL_CONTROL_DIS_PRE_EMPHASIS_HS_SOF_Pos 14UL
#define USBHSPHY_DIGITAL_CONTROL_DIS_PRE_EMPHASIS_HS_SOF_Msk 0x4000UL
#define USBHSPHY_DIGITAL_CONTROL_BIT_TIME_DIS_PRE_EMPHASIS_Pos 16UL
#define USBHSPHY_DIGITAL_CONTROL_BIT_TIME_DIS_PRE_EMPHASIS_Msk 0x3F0000UL
#define USBHSPHY_DIGITAL_CONTROL_CONTROL_HS_TX_IN_Pos 22UL
#define USBHSPHY_DIGITAL_CONTROL_CONTROL_HS_TX_IN_Msk 0x400000UL
#define USBHSPHY_DIGITAL_CONTROL_HX_TX_IN_DP_VALUE_Pos 23UL
#define USBHSPHY_DIGITAL_CONTROL_HX_TX_IN_DP_VALUE_Msk 0x800000UL
#define USBHSPHY_DIGITAL_CONTROL_HX_TX_IN_DN_VALUE_Pos 24UL
#define USBHSPHY_DIGITAL_CONTROL_HX_TX_IN_DN_VALUE_Msk 0x1000000UL
#define USBHSPHY_DIGITAL_CONTROL_CONTROL_HS_TX_PREE_Pos 25UL
#define USBHSPHY_DIGITAL_CONTROL_CONTROL_HS_TX_PREE_Msk 0x2000000UL
#define USBHSPHY_DIGITAL_CONTROL_HX_TX_PREE_DP_VALUE_Pos 26UL
#define USBHSPHY_DIGITAL_CONTROL_HX_TX_PREE_DP_VALUE_Msk 0x4000000UL
#define USBHSPHY_DIGITAL_CONTROL_HX_TX_PREE_DN_VALUE_Pos 27UL
#define USBHSPHY_DIGITAL_CONTROL_HX_TX_PREE_DN_VALUE_Msk 0x8000000UL
#define USBHSPHY_DIGITAL_CONTROL_DISABLE_POWER_SAVING_CDR_CLK480M_Pos 29UL
#define USBHSPHY_DIGITAL_CONTROL_DISABLE_POWER_SAVING_CDR_CLK480M_Msk 0x20000000UL
#define USBHSPHY_DIGITAL_CONTROL_DISABLE_POWER_SAVING_UTMI_HSRX_CLK480M_Pos 30UL
#define USBHSPHY_DIGITAL_CONTROL_DISABLE_POWER_SAVING_UTMI_HSRX_CLK480M_Msk 0x40000000UL
#define USBHSPHY_DIGITAL_CONTROL_DISABLE_POWER_SAVING_UTMI_HSTX_CLK480M_Pos 31UL
#define USBHSPHY_DIGITAL_CONTROL_DISABLE_POWER_SAVING_UTMI_HSTX_CLK480M_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSPHY.VREFGEN_CONTROL */
#define USBHSPHY_VREFGEN_CONTROL_TED_SEL_0_Pos 0UL
#define USBHSPHY_VREFGEN_CONTROL_TED_SEL_0_Msk 0xFUL
#define USBHSPHY_VREFGEN_CONTROL_TED_SEL_1_Pos 4UL
#define USBHSPHY_VREFGEN_CONTROL_TED_SEL_1_Msk 0xF0UL
#define USBHSPHY_VREFGEN_CONTROL_DED_SEL_0_Pos 8UL
#define USBHSPHY_VREFGEN_CONTROL_DED_SEL_0_Msk 0xF00UL
#define USBHSPHY_VREFGEN_CONTROL_DED_SEL_1_Pos 12UL
#define USBHSPHY_VREFGEN_CONTROL_DED_SEL_1_Msk 0xF000UL
#define USBHSPHY_VREFGEN_CONTROL_VREFGEN_ADFT_CTRL_Pos 16UL
#define USBHSPHY_VREFGEN_CONTROL_VREFGEN_ADFT_CTRL_Msk 0xF0000UL
#define USBHSPHY_VREFGEN_CONTROL_VREFGEN_ADFT_EN_Pos 20UL
#define USBHSPHY_VREFGEN_CONTROL_VREFGEN_ADFT_EN_Msk 0x100000UL
#define USBHSPHY_VREFGEN_CONTROL_ENABLE_LV_Pos 31UL
#define USBHSPHY_VREFGEN_CONTROL_ENABLE_LV_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSPHY.REG_SW_1P2_CONTROL */
#define USBHSPHY_REG_SW_1P2_CONTROL_SW_ADFT_CTRL_Pos 0UL
#define USBHSPHY_REG_SW_1P2_CONTROL_SW_ADFT_CTRL_Msk 0xFUL
#define USBHSPHY_REG_SW_1P2_CONTROL_SW_ADFT_EN_Pos 4UL
#define USBHSPHY_REG_SW_1P2_CONTROL_SW_ADFT_EN_Msk 0x10UL
#define USBHSPHY_REG_SW_1P2_CONTROL_USE_REG_Pos 5UL
#define USBHSPHY_REG_SW_1P2_CONTROL_USE_REG_Msk 0x20UL
#define USBHSPHY_REG_SW_1P2_CONTROL_ENABLE_LV_Pos 31UL
#define USBHSPHY_REG_SW_1P2_CONTROL_ENABLE_LV_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSPHY.REG_1P1_CONTROL */
#define USBHSPHY_REG_1P1_CONTROL_ONEP1_ADFT_CTRL_Pos 0UL
#define USBHSPHY_REG_1P1_CONTROL_ONEP1_ADFT_CTRL_Msk 0xFUL
#define USBHSPHY_REG_1P1_CONTROL_ONEP1_ADFT_EN_Pos 4UL
#define USBHSPHY_REG_1P1_CONTROL_ONEP1_ADFT_EN_Msk 0x10UL
#define USBHSPHY_REG_1P1_CONTROL_SWITCH_EN_Pos 8UL
#define USBHSPHY_REG_1P1_CONTROL_SWITCH_EN_Msk 0x100UL
#define USBHSPHY_REG_1P1_CONTROL_ENABLE_LV_Pos 31UL
#define USBHSPHY_REG_1P1_CONTROL_ENABLE_LV_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSPHY.REG_2P5_CONTROL */
#define USBHSPHY_REG_2P5_CONTROL_TWOP5_ADFT_CTRL_Pos 0UL
#define USBHSPHY_REG_2P5_CONTROL_TWOP5_ADFT_CTRL_Msk 0xFUL
#define USBHSPHY_REG_2P5_CONTROL_TWOP5_ADFT_EN_Pos 4UL
#define USBHSPHY_REG_2P5_CONTROL_TWOP5_ADFT_EN_Msk 0x10UL
#define USBHSPHY_REG_2P5_CONTROL_BYPASS_MODE_Pos 8UL
#define USBHSPHY_REG_2P5_CONTROL_BYPASS_MODE_Msk 0x100UL
#define USBHSPHY_REG_2P5_CONTROL_ENABLE_LV_Pos 31UL
#define USBHSPHY_REG_2P5_CONTROL_ENABLE_LV_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSPHY.IREFGEN_CONTROL */
#define USBHSPHY_IREFGEN_CONTROL_IREF_ADFT_CTRL_Pos 0UL
#define USBHSPHY_IREFGEN_CONTROL_IREF_ADFT_CTRL_Msk 0xFUL
#define USBHSPHY_IREFGEN_CONTROL_IREF_ADFT_EN_Pos 4UL
#define USBHSPHY_IREFGEN_CONTROL_IREF_ADFT_EN_Msk 0x10UL
#define USBHSPHY_IREFGEN_CONTROL_BYPASS_MODE_Pos 8UL
#define USBHSPHY_IREFGEN_CONTROL_BYPASS_MODE_Msk 0x100UL
#define USBHSPHY_IREFGEN_CONTROL_ENABLE_LV_Pos 31UL
#define USBHSPHY_IREFGEN_CONTROL_ENABLE_LV_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSPHY.STATUS */
#define USBHSPHY_STATUS_PLL_LOCK_Pos 0UL
#define USBHSPHY_STATUS_PLL_LOCK_Msk 0x1UL
#define USBHSPHY_STATUS_TEST_PLL_LOCK_Pos 2UL
#define USBHSPHY_STATUS_TEST_PLL_LOCK_Msk 0x4UL
#define USBHSPHY_STATUS_VSTATUSTESTER_Pos 3UL
#define USBHSPHY_STATUS_VSTATUSTESTER_Msk 0x7F8UL
#define USBHSPHY_STATUS_LBSTATUS_Pos 11UL
#define USBHSPHY_STATUS_LBSTATUS_Msk 0x7F800UL
#define USBHSPHY_STATUS_LINE_STATE_Pos 19UL
#define USBHSPHY_STATUS_LINE_STATE_Msk 0x180000UL
#define USBHSPHY_STATUS_HOST_DISCONNECT_Pos 21UL
#define USBHSPHY_STATUS_HOST_DISCONNECT_Msk 0x200000UL
#define USBHSPHY_STATUS_PLL_LOSS_CNT_Pos 22UL
#define USBHSPHY_STATUS_PLL_LOSS_CNT_Msk 0x3C00000UL
#define USBHSPHY_STATUS_BISTOK_Pos 26UL
#define USBHSPHY_STATUS_BISTOK_Msk 0x4000000UL
/* MXS40USBHSDEV_USBHSPHY.INTR0 */
#define USBHSPHY_INTR0_PLL_LOCK_Pos 0UL
#define USBHSPHY_INTR0_PLL_LOCK_Msk 0x1UL
#define USBHSPHY_INTR0_PLL_LOSS_Pos 1UL
#define USBHSPHY_INTR0_PLL_LOSS_Msk 0x2UL
#define USBHSPHY_INTR0_TEST_PLL_LOCK_Pos 2UL
#define USBHSPHY_INTR0_TEST_PLL_LOCK_Msk 0x4UL
#define USBHSPHY_INTR0_PLL_RUN_AWAY_STICKY_CHANGE_Pos 3UL
#define USBHSPHY_INTR0_PLL_RUN_AWAY_STICKY_CHANGE_Msk 0x8UL
#define USBHSPHY_INTR0_TEST_PLL_RUN_AWAY_STICKY_CHANGE_Pos 4UL
#define USBHSPHY_INTR0_TEST_PLL_RUN_AWAY_STICKY_CHANGE_Msk 0x10UL
#define USBHSPHY_INTR0_ENABLE_VCCD_Pos 5UL
#define USBHSPHY_INTR0_ENABLE_VCCD_Msk 0x20UL
#define USBHSPHY_INTR0_ENABLE_HS_VCCD_Pos 6UL
#define USBHSPHY_INTR0_ENABLE_HS_VCCD_Msk 0x40UL
#define USBHSPHY_INTR0_BISTDONE_Pos 7UL
#define USBHSPHY_INTR0_BISTDONE_Msk 0x80UL
#define USBHSPHY_INTR0_ERRORFLOW_Pos 8UL
#define USBHSPHY_INTR0_ERRORFLOW_Msk 0x100UL
#define USBHSPHY_INTR0_STRESS_OUT_Pos 9UL
#define USBHSPHY_INTR0_STRESS_OUT_Msk 0x200UL
#define USBHSPHY_INTR0_CAL_DONE_Pos 10UL
#define USBHSPHY_INTR0_CAL_DONE_Msk 0x400UL
/* MXS40USBHSDEV_USBHSPHY.INTR0_SET */
#define USBHSPHY_INTR0_SET_PLL_LOCK_Pos 0UL
#define USBHSPHY_INTR0_SET_PLL_LOCK_Msk 0x1UL
#define USBHSPHY_INTR0_SET_PLL_LOSS_Pos 1UL
#define USBHSPHY_INTR0_SET_PLL_LOSS_Msk 0x2UL
#define USBHSPHY_INTR0_SET_TEST_PLL_LOCK_Pos 2UL
#define USBHSPHY_INTR0_SET_TEST_PLL_LOCK_Msk 0x4UL
#define USBHSPHY_INTR0_SET_PLL_RUN_AWAY_STICKY_CHANGE_Pos 3UL
#define USBHSPHY_INTR0_SET_PLL_RUN_AWAY_STICKY_CHANGE_Msk 0x8UL
#define USBHSPHY_INTR0_SET_TEST_PLL_RUN_AWAY_STICKY_CHANGE_Pos 4UL
#define USBHSPHY_INTR0_SET_TEST_PLL_RUN_AWAY_STICKY_CHANGE_Msk 0x10UL
#define USBHSPHY_INTR0_SET_ENABLE_VCCD_Pos 5UL
#define USBHSPHY_INTR0_SET_ENABLE_VCCD_Msk 0x20UL
#define USBHSPHY_INTR0_SET_ENABLE_HS_VCCD_Pos 6UL
#define USBHSPHY_INTR0_SET_ENABLE_HS_VCCD_Msk 0x40UL
#define USBHSPHY_INTR0_SET_BISTDONE_Pos 7UL
#define USBHSPHY_INTR0_SET_BISTDONE_Msk 0x80UL
#define USBHSPHY_INTR0_SET_ERRORFLOW_Pos 8UL
#define USBHSPHY_INTR0_SET_ERRORFLOW_Msk 0x100UL
#define USBHSPHY_INTR0_SET_STRESS_OUT_Pos 9UL
#define USBHSPHY_INTR0_SET_STRESS_OUT_Msk 0x200UL
#define USBHSPHY_INTR0_SET_CAL_DONE_Pos 10UL
#define USBHSPHY_INTR0_SET_CAL_DONE_Msk 0x400UL
/* MXS40USBHSDEV_USBHSPHY.INTR0_MASK */
#define USBHSPHY_INTR0_MASK_PLL_LOCK_MASK_Pos 0UL
#define USBHSPHY_INTR0_MASK_PLL_LOCK_MASK_Msk 0x1UL
#define USBHSPHY_INTR0_MASK_PLL_LOSS_MASK_Pos 1UL
#define USBHSPHY_INTR0_MASK_PLL_LOSS_MASK_Msk 0x2UL
#define USBHSPHY_INTR0_MASK_TEST_PLL_LOCK_MASK_Pos 2UL
#define USBHSPHY_INTR0_MASK_TEST_PLL_LOCK_MASK_Msk 0x4UL
#define USBHSPHY_INTR0_MASK_PLL_RUN_AWAY_STICKY_CHANGE_MASK_Pos 3UL
#define USBHSPHY_INTR0_MASK_PLL_RUN_AWAY_STICKY_CHANGE_MASK_Msk 0x8UL
#define USBHSPHY_INTR0_MASK_TEST_PLL_RUN_AWAY_STICKY_CHANGE_MASK_Pos 4UL
#define USBHSPHY_INTR0_MASK_TEST_PLL_RUN_AWAY_STICKY_CHANGE_MASK_Msk 0x10UL
#define USBHSPHY_INTR0_MASK_ENABLE_VCCD_MASK_Pos 5UL
#define USBHSPHY_INTR0_MASK_ENABLE_VCCD_MASK_Msk 0x20UL
#define USBHSPHY_INTR0_MASK_ENABLE_HS_VCCD_MASK_Pos 6UL
#define USBHSPHY_INTR0_MASK_ENABLE_HS_VCCD_MASK_Msk 0x40UL
#define USBHSPHY_INTR0_MASK_BISTDONE_MASK_Pos 7UL
#define USBHSPHY_INTR0_MASK_BISTDONE_MASK_Msk 0x80UL
#define USBHSPHY_INTR0_MASK_ERRORFLOW_MASK_Pos 8UL
#define USBHSPHY_INTR0_MASK_ERRORFLOW_MASK_Msk 0x100UL
#define USBHSPHY_INTR0_MASK_STRESS_OUT_MASK_Pos 9UL
#define USBHSPHY_INTR0_MASK_STRESS_OUT_MASK_Msk 0x200UL
#define USBHSPHY_INTR0_MASK_CAL_DONE_MASK_Pos 10UL
#define USBHSPHY_INTR0_MASK_CAL_DONE_MASK_Msk 0x400UL
/* MXS40USBHSDEV_USBHSPHY.INTR0_MASKED */
#define USBHSPHY_INTR0_MASKED_PLL_LOCK_MASKED_Pos 0UL
#define USBHSPHY_INTR0_MASKED_PLL_LOCK_MASKED_Msk 0x1UL
#define USBHSPHY_INTR0_MASKED_PLL_LOSS_MASKED_Pos 1UL
#define USBHSPHY_INTR0_MASKED_PLL_LOSS_MASKED_Msk 0x2UL
#define USBHSPHY_INTR0_MASKED_TEST_PLL_LOCK_MASKED_Pos 2UL
#define USBHSPHY_INTR0_MASKED_TEST_PLL_LOCK_MASKED_Msk 0x4UL
#define USBHSPHY_INTR0_MASKED_PLL_RUN_AWAY_STICKY_CHANGE_MASKED_Pos 3UL
#define USBHSPHY_INTR0_MASKED_PLL_RUN_AWAY_STICKY_CHANGE_MASKED_Msk 0x8UL
#define USBHSPHY_INTR0_MASKED_TEST_PLL_RUN_AWAY_STICKY_CHANGE_MASKED_Pos 4UL
#define USBHSPHY_INTR0_MASKED_TEST_PLL_RUN_AWAY_STICKY_CHANGE_MASKED_Msk 0x10UL
#define USBHSPHY_INTR0_MASKED_ENABLE_VCCD_MASKED_Pos 5UL
#define USBHSPHY_INTR0_MASKED_ENABLE_VCCD_MASKED_Msk 0x20UL
#define USBHSPHY_INTR0_MASKED_ENABLE_HS_VCCD_MASKED_Pos 6UL
#define USBHSPHY_INTR0_MASKED_ENABLE_HS_VCCD_MASKED_Msk 0x40UL
#define USBHSPHY_INTR0_MASKED_BISTDONE_MASKED_Pos 7UL
#define USBHSPHY_INTR0_MASKED_BISTDONE_MASKED_Msk 0x80UL
#define USBHSPHY_INTR0_MASKED_ERRORFLOW_MASKED_Pos 8UL
#define USBHSPHY_INTR0_MASKED_ERRORFLOW_MASKED_Msk 0x100UL
#define USBHSPHY_INTR0_MASKED_STRESS_OUT_MASKED_Pos 9UL
#define USBHSPHY_INTR0_MASKED_STRESS_OUT_MASKED_Msk 0x200UL
#define USBHSPHY_INTR0_MASKED_CAL_DONE_MASKED_Pos 10UL
#define USBHSPHY_INTR0_MASKED_CAL_DONE_MASKED_Msk 0x400UL
/* MXS40USBHSDEV_USBHSPHY.SPARE */
#define USBHSPHY_SPARE_DFT_Pos    0UL
#define USBHSPHY_SPARE_DFT_Msk    0xFFFUL
#define USBHSPHY_SPARE_SPARE0_Pos 12UL
#define USBHSPHY_SPARE_SPARE0_Msk 0xFFF000UL
#define USBHSPHY_SPARE_SPARE1_Pos 24UL
#define USBHSPHY_SPARE_SPARE1_Msk 0xFF000000UL
/* MXS40USBHSDEV_USBHSPHY.AFE_CONTROL_3 */
#define USBHSPHY_AFE_CONTROL_3_CONTROL_CONN_RPD_Pos 0UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_CONN_RPD_Msk 0x1UL
#define USBHSPHY_AFE_CONTROL_3_CONN_RPD_DP_VALUE_Pos 1UL
#define USBHSPHY_AFE_CONTROL_3_CONN_RPD_DP_VALUE_Msk 0x2UL
#define USBHSPHY_AFE_CONTROL_3_CONN_RPD_DN_VALUE_Pos 2UL
#define USBHSPHY_AFE_CONTROL_3_CONN_RPD_DN_VALUE_Msk 0x4UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_CONN_RPU_Pos 3UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_CONN_RPU_Msk 0x8UL
#define USBHSPHY_AFE_CONTROL_3_CONN_RPU1_VALUE_Pos 4UL
#define USBHSPHY_AFE_CONTROL_3_CONN_RPU1_VALUE_Msk 0x10UL
#define USBHSPHY_AFE_CONTROL_3_CONN_RPU2_VALUE_Pos 5UL
#define USBHSPHY_AFE_CONTROL_3_CONN_RPU2_VALUE_Msk 0x20UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_HS_DED_Pos 6UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_HS_DED_Msk 0x40UL
#define USBHSPHY_AFE_CONTROL_3_HS_DED_EN_VALUE_Pos 7UL
#define USBHSPHY_AFE_CONTROL_3_HS_DED_EN_VALUE_Msk 0x80UL
#define USBHSPHY_AFE_CONTROL_3_HS_DED_RESET_VALUE_Pos 8UL
#define USBHSPHY_AFE_CONTROL_3_HS_DED_RESET_VALUE_Msk 0x100UL
#define USBHSPHY_AFE_CONTROL_3_HS_DED_START_VALUE_Pos 9UL
#define USBHSPHY_AFE_CONTROL_3_HS_DED_START_VALUE_Msk 0x200UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_IREF_EN_Pos 10UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_IREF_EN_Msk 0x400UL
#define USBHSPHY_AFE_CONTROL_3_IREF_EN_VALUE_Pos 11UL
#define USBHSPHY_AFE_CONTROL_3_IREF_EN_VALUE_Msk 0x800UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_HS_RX_EN_Pos 12UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_HS_RX_EN_Msk 0x1000UL
#define USBHSPHY_AFE_CONTROL_3_HS_RX_EN_VALUE_Pos 13UL
#define USBHSPHY_AFE_CONTROL_3_HS_RX_EN_VALUE_Msk 0x2000UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_HS_RX_BUF_ON_Pos 14UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_HS_RX_BUF_ON_Msk 0x4000UL
#define USBHSPHY_AFE_CONTROL_3_HS_RX_BUF_ON_VALUE_Pos 15UL
#define USBHSPHY_AFE_CONTROL_3_HS_RX_BUF_ON_VALUE_Msk 0x8000UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_HS_TED_EN_Pos 16UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_HS_TED_EN_Msk 0x10000UL
#define USBHSPHY_AFE_CONTROL_3_HS_TED_EN_VALUE_Pos 17UL
#define USBHSPHY_AFE_CONTROL_3_HS_TED_EN_VALUE_Msk 0x20000UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_HS_TX_EN_SLOW_Pos 18UL
