RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_mxs40usbhsdev.h
#define USBHSPHY_AFE_CONTROL_3_CONTROL_HS_TX_EN_SLOW_Msk 0x40000UL
#define USBHSPHY_AFE_CONTROL_3_HS_TX_EN_SLOW_VALUE_Pos 19UL
#define USBHSPHY_AFE_CONTROL_3_HS_TX_EN_SLOW_VALUE_Msk 0x80000UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_RPU_SEL_Pos 20UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_RPU_SEL_Msk 0x100000UL
#define USBHSPHY_AFE_CONTROL_3_RPU_SEL_VALUE_Pos 21UL
#define USBHSPHY_AFE_CONTROL_3_RPU_SEL_VALUE_Msk 0x200000UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_SE_RX_EN_DP_Pos 22UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_SE_RX_EN_DP_Msk 0x400000UL
#define USBHSPHY_AFE_CONTROL_3_SE_RX_EN_DP_VALUE_Pos 23UL
#define USBHSPHY_AFE_CONTROL_3_SE_RX_EN_DP_VALUE_Msk 0x800000UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_SE_RX_EN_DN_Pos 24UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_SE_RX_EN_DN_Msk 0x1000000UL
#define USBHSPHY_AFE_CONTROL_3_SE_RX_EN_DN_VALUE_Pos 25UL
#define USBHSPHY_AFE_CONTROL_3_SE_RX_EN_DN_VALUE_Msk 0x2000000UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_LS_NFS_Pos 26UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_LS_NFS_Msk 0x4000000UL
#define USBHSPHY_AFE_CONTROL_3_LS_NFS_VALUE_Pos 27UL
#define USBHSPHY_AFE_CONTROL_3_LS_NFS_VALUE_Msk 0x8000000UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_LSFS_DIFF_RX_EN_Pos 28UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_LSFS_DIFF_RX_EN_Msk 0x10000000UL
#define USBHSPHY_AFE_CONTROL_3_LSFS_DIFF_RX_EN_VALUE_Pos 29UL
#define USBHSPHY_AFE_CONTROL_3_LSFS_DIFF_RX_EN_VALUE_Msk 0x20000000UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_LFS_TX_EN_Pos 30UL
#define USBHSPHY_AFE_CONTROL_3_CONTROL_LFS_TX_EN_Msk 0x40000000UL
#define USBHSPHY_AFE_CONTROL_3_LFS_TX_EN_VALUE_Pos 31UL
#define USBHSPHY_AFE_CONTROL_3_LFS_TX_EN_VALUE_Msk 0x80000000UL
/* MXS40USBHSDEV_USBHSPHY.AFE_CONTROL_4 */
#define USBHSPHY_AFE_CONTROL_4_CONTROL_LFS_TX_IN_Pos 0UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_LFS_TX_IN_Msk 0x1UL
#define USBHSPHY_AFE_CONTROL_4_LFS_TX_IN_VALUE_Pos 1UL
#define USBHSPHY_AFE_CONTROL_4_LFS_TX_IN_VALUE_Msk 0x2UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_LFS_TX_ON_Pos 2UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_LFS_TX_ON_Msk 0x4UL
#define USBHSPHY_AFE_CONTROL_4_LFS_TX_ON_VALUE_Pos 3UL
#define USBHSPHY_AFE_CONTROL_4_LFS_TX_ON_VALUE_Msk 0x8UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_ENASE0_Pos 4UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_ENASE0_Msk 0x10UL
#define USBHSPHY_AFE_CONTROL_4_ENASE0_VALUE_Pos 5UL
#define USBHSPHY_AFE_CONTROL_4_ENASE0_VALUE_Msk 0x20UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_ENASE1_Pos 6UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_ENASE1_Msk 0x40UL
#define USBHSPHY_AFE_CONTROL_4_ENASE1_VALUE_Pos 7UL
#define USBHSPHY_AFE_CONTROL_4_ENASE1_VALUE_Msk 0x80UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_CAL_Pos 8UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_CAL_Msk 0x100UL
#define USBHSPHY_AFE_CONTROL_4_CAL_VALUE_Pos 9UL
#define USBHSPHY_AFE_CONTROL_4_CAL_VALUE_Msk 0x3E00UL
#define USBHSPHY_AFE_CONTROL_4_ONCAL_VALUE_Pos 14UL
#define USBHSPHY_AFE_CONTROL_4_ONCAL_VALUE_Msk 0x4000UL
#define USBHSPHY_AFE_CONTROL_4_CAL_F1_VALUE_Pos 15UL
#define USBHSPHY_AFE_CONTROL_4_CAL_F1_VALUE_Msk 0x8000UL
#define USBHSPHY_AFE_CONTROL_4_CAL_F2_VALUE_Pos 16UL
#define USBHSPHY_AFE_CONTROL_4_CAL_F2_VALUE_Msk 0x10000UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_SE_TX_IN_EDN_Pos 17UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_SE_TX_IN_EDN_Msk 0x20000UL
#define USBHSPHY_AFE_CONTROL_4_SE_TX_IN_EDN_VALUE_Pos 18UL
#define USBHSPHY_AFE_CONTROL_4_SE_TX_IN_EDN_VALUE_Msk 0x40000UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_SE_TX_EN_EDN_Pos 19UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_SE_TX_EN_EDN_Msk 0x80000UL
#define USBHSPHY_AFE_CONTROL_4_SE_TX_EN_EDN_VALUE_Pos 20UL
#define USBHSPHY_AFE_CONTROL_4_SE_TX_EN_EDN_VALUE_Msk 0x100000UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_HS_PREE_EN_Pos 21UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_HS_PREE_EN_Msk 0x200000UL
#define USBHSPHY_AFE_CONTROL_4_HS_PREE_EN_VALUE_Pos 22UL
#define USBHSPHY_AFE_CONTROL_4_HS_PREE_EN_VALUE_Msk 0x400000UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_HS_TERM_EN_Pos 23UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_HS_TERM_EN_Msk 0x800000UL
#define USBHSPHY_AFE_CONTROL_4_HS_TERM_EN_VALUE_Pos 24UL
#define USBHSPHY_AFE_CONTROL_4_HS_TERM_EN_VALUE_Msk 0x1000000UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_HS_TX_EN_Pos 25UL
#define USBHSPHY_AFE_CONTROL_4_CONTROL_HS_TX_EN_Msk 0x2000000UL
#define USBHSPHY_AFE_CONTROL_4_HS_TX_EN_VALUE_Pos 26UL
#define USBHSPHY_AFE_CONTROL_4_HS_TX_EN_VALUE_Msk 0x4000000UL
#define USBHSPHY_AFE_CONTROL_4_HS_TX_EN_FAST_VALUE_Pos 27UL
#define USBHSPHY_AFE_CONTROL_4_HS_TX_EN_FAST_VALUE_Msk 0x8000000UL
/* MXS40USBHSDEV_USBHSPHY.UTMI_CONTROL_2 */
#define USBHSPHY_UTMI_CONTROL_2_DED_RESET_ASSERT_X6_BIT_Pos 0UL
#define USBHSPHY_UTMI_CONTROL_2_DED_RESET_ASSERT_X6_BIT_Msk 0x7UL
#define USBHSPHY_UTMI_CONTROL_2_DED_RESET_ASSERT_BIT_Pos 3UL
#define USBHSPHY_UTMI_CONTROL_2_DED_RESET_ASSERT_BIT_Msk 0x38UL
#define USBHSPHY_UTMI_CONTROL_2_DED_RESET_DEASSERT_X6_BIT_Pos 6UL
#define USBHSPHY_UTMI_CONTROL_2_DED_RESET_DEASSERT_X6_BIT_Msk 0x1C0UL
#define USBHSPHY_UTMI_CONTROL_2_DED_RESET_DEASSERT_BIT_Pos 9UL
#define USBHSPHY_UTMI_CONTROL_2_DED_RESET_DEASSERT_BIT_Msk 0xE00UL
#define USBHSPHY_UTMI_CONTROL_2_DED_START_ASSERT_X6_BIT_Pos 12UL
#define USBHSPHY_UTMI_CONTROL_2_DED_START_ASSERT_X6_BIT_Msk 0x7000UL
#define USBHSPHY_UTMI_CONTROL_2_DED_START_ASSERT_BIT_Pos 15UL
#define USBHSPHY_UTMI_CONTROL_2_DED_START_ASSERT_BIT_Msk 0x38000UL
#define USBHSPHY_UTMI_CONTROL_2_DED_START_DEASSERT_X6_BIT_Pos 18UL
#define USBHSPHY_UTMI_CONTROL_2_DED_START_DEASSERT_X6_BIT_Msk 0x1C0000UL
#define USBHSPHY_UTMI_CONTROL_2_DED_START_DEASSERT_BIT_Pos 21UL
#define USBHSPHY_UTMI_CONTROL_2_DED_START_DEASSERT_BIT_Msk 0xE00000UL
/* MXS40USBHSDEV_USBHSPHY.PLL_TRIMS */
#define USBHSPHY_PLL_TRIMS_RUN_AWAY_Pos 0UL
#define USBHSPHY_PLL_TRIMS_RUN_AWAY_Msk 0x3UL
#define USBHSPHY_PLL_TRIMS_CP_CUR_Pos 2UL
#define USBHSPHY_PLL_TRIMS_CP_CUR_Msk 0xCUL
#define USBHSPHY_PLL_TRIMS_LDO_VCO_Pos 4UL
#define USBHSPHY_PLL_TRIMS_LDO_VCO_Msk 0x70UL
#define USBHSPHY_PLL_TRIMS_LDO_CORE_Pos 7UL
#define USBHSPHY_PLL_TRIMS_LDO_CORE_Msk 0x380UL
#define USBHSPHY_PLL_TRIMS_TEST_RUN_AWAY_Pos 10UL
#define USBHSPHY_PLL_TRIMS_TEST_RUN_AWAY_Msk 0xC00UL
#define USBHSPHY_PLL_TRIMS_TEST_CP_CUR_Pos 12UL
#define USBHSPHY_PLL_TRIMS_TEST_CP_CUR_Msk 0x3000UL
#define USBHSPHY_PLL_TRIMS_TEST_LDO_VCO_Pos 14UL
#define USBHSPHY_PLL_TRIMS_TEST_LDO_VCO_Msk 0x1C000UL
#define USBHSPHY_PLL_TRIMS_TEST_LDO_CORE_Pos 17UL
#define USBHSPHY_PLL_TRIMS_TEST_LDO_CORE_Msk 0xE0000UL
/* MXS40USBHSDEV_USBHSPHY.AFE_TRIMS */
#define USBHSPHY_AFE_TRIMS_TRIM_VREF_Pos 0UL
#define USBHSPHY_AFE_TRIMS_TRIM_VREF_Msk 0xFUL
#define USBHSPHY_AFE_TRIMS_TRIM_IREF_Pos 4UL
#define USBHSPHY_AFE_TRIMS_TRIM_IREF_Msk 0xF0UL
#define USBHSPHY_AFE_TRIMS_TRIM_VREG_2P5_Pos 8UL
#define USBHSPHY_AFE_TRIMS_TRIM_VREG_2P5_Msk 0xF00UL
#define USBHSPHY_AFE_TRIMS_TRIM_VREG_1P1_Pos 12UL
#define USBHSPHY_AFE_TRIMS_TRIM_VREG_1P1_Msk 0xF000UL
#define USBHSPHY_AFE_TRIMS_TRIM_REG_SW_1P2_Pos 16UL
#define USBHSPHY_AFE_TRIMS_TRIM_REG_SW_1P2_Msk 0xF0000UL
#define USBHSPHY_AFE_TRIMS_TRIM_AFE_HS_IREF_Pos 20UL
#define USBHSPHY_AFE_TRIMS_TRIM_AFE_HS_IREF_Msk 0x700000UL
#define USBHSPHY_AFE_TRIMS_TRIM_VREF_600M_0_Pos 23UL
#define USBHSPHY_AFE_TRIMS_TRIM_VREF_600M_0_Msk 0x7800000UL
#define USBHSPHY_AFE_TRIMS_TRIM_VREF_600M_1_Pos 27UL
#define USBHSPHY_AFE_TRIMS_TRIM_VREF_600M_1_Msk 0x78000000UL


#endif /* _CYIP_MXS40USBHSDEV_H_ */


/* [] END OF FILE */
